// csv テンプレート
const csvTemplate = new Map();

// 加算マスタ
csvTemplate.set(
  'mst_addition',
  {
    title: [
        "加算・管理料名称",
        "加算略称",
        "種別区分（'1'：施設）透析液水質確保加算、'2'：固有）障害者加算、'3'：患者）指定病名連動、'4'：固有）慢性維持透析濾過加算、'5'：固有）長時間加算、'6'：処置）指定薬剤実施連動、'7'：処置）指定患者イベント連動、'8'：処置）指定検査依頼連動、'9'：固有）導入期加算、'10'：固有）休日加算、'11'：固有）時間外加算、'12'：汎用）その他",
        "算定間隔（算定できる間隔を指定。'0':月１、'1':週１、'3':毎回）",
        "算定回（月１）（'0' : 月初めの透祈・週初めの透析、'1'：回目の透祈、'2'：月最終の透折・週最終の透析）",
        "算定回数上限（算定間隔の算定できる期間内での算定回数上限。なお0':上限なし）",
        "連携コード１",
        "連携コード２",
        "連携コード３",
      ],
    fields: [
        "addition_name",
        "addition_short_name",
        "addition_class",
        "addition_span",
        "addition_limit_type",
        "addition_limit",
        "in_hospital_cd_1",
        "in_hospital_cd_2",
        "in_hospital_cd_3",
  ]
  }
);

// 検査セットマスタ
csvTemplate.set(
    'mst_exam_set',
    {
      title: [
          "検査セット名",
          "省略検査セット名",
          "セット使用区分('0'：両用、'1'：依頼専用、'2'：結果専用)",
          "至急フラグ('0'：通常、'1'：至急可)",
          "その他検査時刻(0000)",
          "連携コード1",
          "連携コード2",
          "連携コード3"
        ],
      fields: [
            "exam_set_name",
            "exam_set_short_name",
            "exam_set_class",
            "can_emergency",
            "other_exam_time",
            "in_hospital_cd1",
            "in_hospital_cd2",
            "in_hospital_cd3",
      ]

    }
  );
  // ベッドグループ・透析室マスタ
  csvTemplate.set(
    'mst_room_bed_group',
    {
      title: [
            "透析室・ベッドグループ名",
            "グループ区分('1'：ベッドグループ、'2'：透析室、'3'：その他)",
            "連携コード1",
            "連携コード2",
            "連携コード3",
        ],
      fields: [
            "room_bed_group_name",
            "group_class",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
            "in_hospital_cd_3",
      ]
    }
  );
  // 禁忌・アレルギーマスタ
  csvTemplate.set(
    'mst_taboo_allergy',
    {
      title: [
            "禁忌・アレルギー名",
            "連携コード1",
            "連携コード2",
        ],
      fields: [
            "content",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
  // 保険マスタ
  csvTemplate.set(
    'mst_insurance',
    {
      title: [
            "保険名",
            "保険者名",
            "保険略称",
            "保険区分('0'：保険、'1'：公費)",
            "負担率（外来）(0)",
            "負担率（入院）(0)",
            "連携コード1",
            "連携コード2"
        ],
      fields: [
            "name",
            "insu_name",
            "insu_name_short",
            "insu_type",
            "futan_g",
            "futan_n",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
  // 患者イベントテンプレートマスタ
  csvTemplate.set(
    'mst_pat_event_data_template',
    {
      title: [
            "テンプレート名",
        ],
      fields: [
            "template_name",
      ]
    }
  );
  // 治療方法マスタ
  csvTemplate.set(
    'mst_treatment',
    {
      title: [
            "治療方法名",
            "装置モード（'-1'：不明、'0'：HD、'1'：ECUM、'2'：HDF、'3'：HF、'4'：HD+補液、'5'：ECUM+補液、'6'：AFBF、'7'：OHDF、'8'：OHF、'9'：特殊浄化、'10'：I-HDF）",
            "グラフ時間幅（'6'：6、'8'：8、'10'：10）",
            "利用開始日A",
            "連携コードA-1",
            "連携コードA-2",
            "連携コードA-3",
            "連携コードA-4",
            "利用開始日B",
            "連携コードB-1",
            "連携コードB-2",
            "連携コードB-3",
            "連携コードB-4",
        ],
      fields: [
            "treatment_name",
            "device_mode",
            "graph_time_scale",
            "in_hosp_a_startdate",
            "in_hospital_cd_a1",
            "in_hospital_cd_a2",
            "in_hospital_cd_a3",
            "in_hospital_cd_a4",
            "in_hosp_b_startdate",
            "in_hospital_cd_b1",
            "in_hospital_cd_b2",
            "in_hospital_cd_b3",
            "in_hospital_cd_b4",
      ]
    }
  );
  //回診記録マスタ
  csvTemplate.set(
    'mst_round_type',
    {
      title: [
            "回診記録タイトル",
            "内容",
            "内容省略フラグ(0)('0':省略しない、'1':省略する)",
            "回診記指示コメント転記初期値録タイトル(0)('0':チェックなし、'1':チェックあり)",
            "転記区分初期値(0)('0':継続、'1':当日のみ)",
        ],
      fields: [
            "round_type_name",
            "content",
            "is_content_omission",
            "comment_post_default",
            "posting_class_default",
      ]
    }
  );

  // 治療方法セットマスタ
  csvTemplate.set(
    'mst_treatment_set',
    {
      title: [
            "治療方法セット名",
        ],
      fields: [
            "treatment_set_name",
      ]
    }
  );
  // VAマスタ
  csvTemplate.set(
    'mst_va',
    {
      title: [
            "VA名",
            "VA方向('0':両方、'1':左、'2':右、'3':なし、'-':不明)",
            "連携コード1",
            "連携コード2",
        ],
      fields: [
            "va_name",
            "va_direct",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
  // VAマスタ
  csvTemplate.set(
    'mst_medicate_timing',
    {
      title: [
            "投与タイミング名称",
            "透析工程（'001':透析前、'002':透析中、'003':透析後）",
            "治療開始後通知時間[分]",
            "装置知らせ（'1':有効、'2':無効）",
        ],
      fields: [
            "medicate_timing_name",
            "dialysis_progress_cd",
            "alert_time",
            "is_alert",
      ]
    }
  );
  // 薬剤分類マスタ
  csvTemplate.set(
    'mst_medicine_class',
    {
      title: [
            "分類名称",
            "分類区分（'0':未分類、'1':抗凝固剤、'2':透析液、'3':補液）",
            "連携コード1",
        ],
      fields: [
            "class_name",
            "class_type",
            "in_hospital_cd_1",
      ]
    }
  );
  // 薬剤マスタ
  csvTemplate.set(
    'mst_medicine',
    {
      title: [
            "薬剤名",
            "省略薬剤名",
            "指示単位",
            "レセ単位",
            "指示単位小数部桁数（0~9）",
            "レセ単位小数部桁数（0~9）",
            "レセ換算(0：固定、1：換算、3：残量破棄)",
            "治験フラグ（0：選択しない、1：選択）",
            "注射（0：選択しない、1：選択）",
            "投薬実施フラグ（0：選択しない、1：選択）",
            "連携コード１",
            "連携コード２",
            "連携コード３",
            "連携コード4",
            "使用開始日",
            "使用終了日",
        ],
      fields: [
            "medicine_name",
            "medicine_short_name",
            "unit",
            "unit_second",
            "unit_decimal_point",
            "unit_decimal_point_second",
            "is_exchange",
            "is_trial",
            "is_shot",
            "is_medicated",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
            "in_hospital_cd_3",
            "in_hospital_cd_4",
            "use_start_date",
            "use_end_date",
      ]
    }
  );
  // 調製薬剤マスタ
  csvTemplate.set(
    'mst_medicine_mix',
    {
      title: [
            "調製薬剤名",
            "省略調製薬剤名",
            "指示単位",
            "指示単位小数部桁数（0~9）",
            "注射（0：選択しない、1：選択）",
            "投薬実施フラグ（0：選択しない、1：選択）",
            "連携コード１",
            "連携コード２",
            "連携コード３",
        ],
      fields: [
            "medicine_mix_name",
            "medicine_mix_short_name",
            "unit",
            "unit_decimal_point",
            "is_shot",
            "is_medicated",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
            "in_hospital_cd_3",
      ]
    }
  );
  // 薬効換算マスタ
  csvTemplate.set(
    'mst_medicine_group',
    {
      title: [
            "薬剤グループ名",
            "単位",
            "グラフ上限（0）",
            "グラフ下限（0）",
        ],
      fields: [
            "medicine_group_name",
            "medicine_group_unit",
            "graph_upper",
            "graph_lower",
      ]
    }
  );
  // 薬剤セットマスタ
  csvTemplate.set(
    'mst_medicine_set',
    {
      title: [
            "薬剤セット名",
            "省略薬剤セット名",
            "連携コード1",
            "連携コード2",
        ],
      fields: [
            "medicine_set_name",
            "medicine_set_short_name",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
  // 投薬支援マスタ
  csvTemplate.set(
    'mst_medicine_support',
    {
      title: [
            "投薬支援パターン名",
            "目標検査値（0）",
        ],
      fields: [
            "medicine_support_name",
            "target_inspection",
      ]
    }
  );
  // ダイアライザマスタ
  csvTemplate.set(
    'mst_dialyzer',
    {
      title: [
            "型番",
            "メーカ名",
            "ダイアライザ種別('0':中空糸　'1':積層)",
            "機能分類",
            "面積(0)",
            "UFR(0)",
            "KoA",
            "材質",
            "WET/DRY('1':ＷＥＴ、'2':ＤＲＹ、'0':不明)",
            "滅菌",
            "UFR警報点上限(1)",
            "UFR警報点下限(0)",
            "UFR低下警報点(9)",
            "血流量(200)",
            "透析液流量(500)",
            "尿素クリアランス",
            "ガスパージ時間",
            "置換洗浄量（透析液）",
            "膜洗浄（中空糸）('0':使用しない'1':使用する)",
            "入り数",
            "使用開始日",
            "使用終了日",
            "連携コード1",
            "連携コード2",
            "連携コード3",
            "連携コード4",
        ],
      fields: [
            "model_number",
            "maker",
            "dialyzer_type",
            "function_class",
            "area",
            "ufr",
            "koa",
            "material",
            "wetdry",
            "sterilization",
            "ufr_warning_max",
            "ufr_warning_min",
            "ufr_warning_reduction",
            "bloodamt",
            "alqd_flood_vol",
            "urea_clearance",
            "gas_purge_time",
            "substituent_wash_amt",
            "membrane_wash",
            "in_number",
            "use_start_date",
            "use_end_date",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
            "in_hospital_cd_3",
            "in_hospital_cd_4",
      ]
    }
  );
  // 医療材料分類マスタ
  csvTemplate.set(
    'mst_equipment_class',
    {
      title: [
            "分類名称",
            "分類区分（'0':未分類、'1':血液回路、'2':穿刺針(SN以外)、'3':穿刺針(SN)、'4':吸着カラム、'5':吸着器、'6':分離器、）",
            "連携コード1",
        ],
      fields: [
            "class_name",
            "class_type",
            "in_hospital_cd_1",
      ]
    }
  );
  // 医療材料マスタ
  csvTemplate.set(
    'mst_equipment',
    {
      title: [
            "医療材料名",
            "省略医療材料名",
            "単位",
            "標準医療材料コード",
            "治験（'0': 、'1':治験）",
            "使用開始日",
            "使用終了日",
            "連携コード1",
            "連携コード2",
            "連携コード3",
            "連携コード4",
        ],
      fields: [
            "equipment_name",
            "equipment_short_name",
            "unit",
            "standard_equipment_cd",
            "is_trial",
            "use_start_date",
            "use_end_date",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
            "in_hospital_cd_3",
            "in_hospital_cd_4",
      ]
    }
  );
  // 医療材料セットマスタ
  csvTemplate.set(
    'mst_equipment_set',
    {
      title: [
            "医療材料セット名",
            "省略医療材料セット名",
            "連携コード1",
            "連携コード2",
        ],
      fields: [
            "equipment_set_name",
            "equipment_set_short_name",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
  // 治療記録モニタグラフマスタ
  csvTemplate.set(
    'mst_monitor_graph',
    {
      title: [
            "モニタグラフ名",
            "左項目（'0'：'工程'、'1'：'経過時間'、'2'：'経過時間(ECUM)'、'3'：'残り時間(除水完了)'、'4'：'残り時間(透析完了)'、'5'：'除水積算値'、'6'：'除水速度'、'7'：'血液循環量'、'8'：'血流量'、'9'：'ＩＰ総量'、'10'：'ＩＰ速度'、'11'：'静脈圧'、'12'：'透析液圧'、'13'：'ＴＭＰ'、'14'：'ﾀﾞｲｱﾗｲｻﾞｰ入口圧'、'15'：'ﾀﾞｲｱﾗｲｻﾞｰ差圧'、'16'：'血液入口～静脈平均圧'、'17'：'ΔＢＶ'、'18'：'バイカーボ濃度'、'19'：'透析液濃度'、'20'：'Ｎａ濃度'、'21'：'透析液温度'、'22'：'透析液流量'、'23'：'漏血量'、'24'：'給液圧（上限）'、'25'：'給液圧（下限）'、'26'：'ＵＦＲ'、'27'：'ＵＦＲ低下率'、'28'：'初期ＵＦＲ測定値'、'29'：'ＴＭＰ補正値'、'30'：'透析運転時間'、'31'：'治療モード'、'32'：'除水目標値'、'33'：'除水速度設定値'、'34'：'透析液温度設定値'、'35'：'透析液流量設定値'、'36'：'血流量設定値'、'37'：'IP速度設定'、'38'：'Kt/V測定値'、'39'：'静脈圧警報点（上限）'、'40'：'静脈圧警報点（下限）'、'41'：'透析液圧警報点(上限)'、'42'：'透析液圧警報点(下限)'、'43'：'ＴＭＰ警報点（上限）'、'44'：'ＴＭＰ警報点（下限）'、'45'：'ダイアライザー入口圧警報点（上限）'、'46'：'ダイアライザー入口圧警報点（下限）'、'47'：'ダイアライザー差圧警報点（上限）'、'48'：'ダイアライザー差圧警報点（下限）'、'49'：'ΔBV低下警報点１'、'50'：'ΔBV低下警報点２'、'51'：'ΔBV変化率警報点'、'52'：'BPM関連データ9'、'53'：'BPM関連データ10'、'54'：'バイカーボ濃度警報点（上限）'、'55'：'バイカーボ濃度警報点（下限）'、'56'：'透析液濃度警報点（上限）'、'57'：'透析液濃度警報点（下限）'、'58'：'Ｎａ濃度警報点(上限)'、'59'：'Ｎａ濃度警報点(下限)'、'60'：'透析液温度警報点（上限）'、'61'：'透析液温度警報点（下限）'、'62'：'漏血量警報'、'63'：'給水圧警報点（上限）'、'64'：'給水圧警報点（下限）'、'65'：'初期ＵＦＲ警報点（上限）'、'66'：'初期ＵＦＲ警報点（下限）'、'67'：'ＵＦＲ低下率警報'、'68'：'Kt/V'、'69'：'運転中の血流量積算値'、'70'：'補液量設定値'、'71'：'補液速度'、'72'：'補液量現在値'、'73'：'補液速度設定値'、'74'：'補液温度'、'75'：'補液温度設定値'、'76'：'濾液速度'、'77'：'荷重計'、'78'：'残り時間(補液完了)'、'79'：'ＵＲＲ'、'80'：'ΔBV変化率'、'81'：'PWI'、'82'：'BPM関連データ1'、'83'：'BPM関連データ2'、'84'：'BPM関連データ3'、'85'：'ΔBVリファレンスエリア上限'、'86'：'ΔBVリファレンスエリア下限'、'87'：'BPM関連データ6'、'88'：'PRR'、'89'：'再循環率測定結果（BVMS連携用）'、'90'：'最高血圧'、'91'：'最低血圧'、'92'：'平均血圧'、'93'：'脈拍'、'94'：'体温'、'95'：'ΔBV5分平均値'、'96'：'ΔBV最大最小を除いた5分平均値'、'97'：'推定血流量'、'98'：'血流量不足率'、'100'：'ΔBV(BVplus)'、'101'：'Ht'、'102'：'LDQb'、'Z11'：'[ACHΣ]治療モード'、'Z21'：'[ACHΣ]工程状態'、'Z31'：'[ACHΣ]除水速度'、'Z41'：'[ACHΣ]血液流量'、'Z51'：'[ACHΣ]シリンジ流量'、'Z61'：'[ACHΣ]ろ過流量'、'Z71'：'[ACHΣ]透析液/ドレン流量'、'Z81'：'[ACHΣ]補液流量'、'Z91'：'[ACHΣ]透析液加温器温度'、'Z101'：'[ACHΣ]補液加温器温度'、'Z111'：'[ACHΣ]現在除水量'、'Z121'：'[ACHΣ]現在血液循環量'、'Z131'：'[ACHΣ]現在ろ過量'、'Z141'：'[ACHΣ]現在透析液/ドレン量'、'Z151'：'[ACHΣ]現在補液量'、'Z161'：'[ACHΣ]治療時間'、'Z171'：'[ACHΣ]シリンジ積算量'、'Z181'：'[ACHΣ]目標除水量'、'Z191'：'[ACHΣ]目標血液循環量'、'Z201'：'[ACHΣ]目標ろ過量'、'Z211'：'[ACHΣ]目標透析液/ドレン量'、'Z221'：'[ACHΣ]目標補液量'、'Z231'：'[ACHΣ]目標治療時間'、'Z241'：'[ACHΣ]脱血圧'、'Z251'：'[ACHΣ]入口圧'、'Z261'：'[ACHΣ]静脈圧'、'Z271'：'[ACHΣ]ろ過圧'、'Z281'：'[ACHΣ]排気圧/2次膜圧'、'Z291'：'[ACHΣ]TMP/TMP1'、'Z301'：'[ACHΣ]TMP2'、'Z311'：'[ACHΣ]差圧'、'Z321'：'[ACHΣ]気泡検知警報'、'Z331'：'[ACHΣ]漏血警報'、'Z341'：'[ACHΣ]加温器警報'、'Z351'：'[ACHΣ]脱血圧警報'、'Z361'：'[ACHΣ]入口圧警報'、'Z371'：'[ACHΣ]静脈圧警報'、'Z381'：'[ACHΣ]ろ過圧警報'、'Z391'：'[ACHΣ]排気圧/2次膜圧警報'、'Z401'：'[ACHΣ]TMP警報'、'Z411'：'[ACHΣ]TMP2警報'、'Z421'：'[ACHΣ]差圧警報'、'Z431'：'[ACHΣ]その他警報'、'Z441'：'[ACHΣ]クエン酸流量'、'Z451'：'[ACHΣ]現在クエン酸量'、'Z12'：'[KM8900]測定値TMP'、'Z22'：'[KM8900]測定値入口圧'、'Z32'：'[KM8900]測定値返血圧'、'Z42'：'[KM8900]測定値2次膜圧(吸着圧)'、'Z52'：'[KM8900]圧力上限警報設定値TMP'、'Z62'：'[KM8900]圧力上限警報設定値入口圧'、'Z72'：'[KM8900]圧力上限警報設定値返血圧'、'Z82'：'[KM8900]圧力上限警報設定値2次膜圧(吸着圧)'、'Z92'：'[KM8900]流量情報BP瞬時流量'、'Z102'：'[KM8900]流量情報PP瞬時流量'、'Z112'：'[KM8900]流量情報DP瞬時流量'、'Z122'：'[KM8900]流量情報BP積算流量'、'Z132'：'[KM8900]流量情報PP積算流量'、'Z142'：'[KM8900]流量情報DP積算流量'、'Z152'：'[KM8900]流量情報除水積算流量'、'Z162'：'[KM8900]流量情報血漿処理目標値'、'Z172'：'[KM8900]その他情報加温器温度'、'Z182'：'[KM8900]その他情報バランス'、'Z192'：'[KM8900]経過時間'、'Z202'：'[KM8900]その他情報アラーム番号'、'Z212'：'[KM8900]その他情報自己診断番号'、'Z222'：'[KM8900]その他情報モード(用途)'、'Z232'：'[KM8900]その他情報工程情報'、'Z13'：'[iQ21]治療経過時間'、'Z23'：'[iQ21]除水速度'、'Z33'：'[iQ21]ろ過ポンプ流量'、'Z43'：'[iQ21]補液ポンプ流量'、'Z53'：'[iQ21]透析液ポンプ流量'、'Z63'：'[iQ21]血液ポンプ流量'、'Z73'：'[iQ21]シリンジポンプ流量'、'Z83'：'[iQ21]除水量積算値'、'Z93'：'[iQ21]ろ過量積算値'、'Z103'：'[iQ21]補液量積算値'、'Z113'：'[iQ21]透析液量積算値'、'Z123'：'[iQ21]血液循環量'、'Z133'：'[iQ21]シリンジポンプ積算値'、'Z143'：'[iQ21]採血圧'、'Z153'：'[iQ21]動脈圧'、'Z163'：'[iQ21]静脈圧'、'Z173'：'[iQ21]ろ過圧'、'Z183'：'[iQ21]TMP'、'Z193'：'[iQ21]分離ポンプ流量'、'Z203'：'[iQ21]返漿ポンプ流量'、'Z213'：'[iQ21]ドレンポンプ流量'、'Z223'：'[iQ21]分離量積算値'、'Z233'：'[iQ21]返漿量積算値'、'Z243'：'[iQ21]ドレン量積算値'、'Z253'：'[iQ21]血漿圧'、'Z263'：'[iQ21]血漿入口圧'、'Z14'：'[KM9000]測定値TMP圧'、'Z24'：'[KM9000]測定値入口圧'、'Z34'：'[KM9000]測定値返血圧'、'Z44'：'[KM9000]測定値ろ過圧'、'Z54'：'[KM9000]測定値浄化器圧'、'Z64'：'[KM9000]設定値TMP圧'、'Z74'：'[KM9000]設定値入口圧'、'Z84'：'[KM9000]設定値返血圧・上限'、'Z94'：'[KM9000]設定値返血圧・下限'、'Z104'：'[KM9000]設定値浄化器圧'、'Z114'：'[KM9000]設定値除水設定値'、'Z124'：'[KM9000]流量情報血液ﾎﾟﾝﾌﾟ指令流量'、'Z134'：'[KM9000]流量情報透析液ﾎﾟﾝﾌﾟ指令流量'、'Z144'：'[KM9000]流量情報補充液ﾎﾟﾝﾌﾟ指令流量'、'Z154'：'[KM9000]流量情報ろ液ﾎﾟﾝﾌﾟ指令流量'、'Z164'：'[KM9000]流量情報血液ﾎﾟﾝﾌﾟ積算流量'、'Z174'：'[KM9000]流量情報透析液ﾎﾟﾝﾌﾟ積算流量'、'Z184'：'[KM9000]流量情報補充液ﾎﾟﾝﾌﾟ積算流量'、'Z194'：'[KM9000]流量情報除水積算流量'、'Z204'：'[KM9000]その他情報加温器温度'、'Z214'：'[KM9000]その他情報除水差分/重量値'、'Z224'：'[KM9000]その他情報初期診断情報'、'Z234'：'[KM9000]その他情報ｱﾗｰﾑ情報1'、'Z244'：'[KM9000]その他情報ｱﾗｰﾑ情報2'、'Z254'：'[KM9000]その他情報ｱﾗｰﾑ情報3'、'Z264'：'[KM9000]その他情報ｱﾗｰﾑ情報4'、'Z274'：'[KM9000]その他情報ｱﾗｰﾑ情報5'、'Z284'：'[KM9000]その他情報ｱﾗｰﾑ情報6'、'Z294'：'[KM9000]その他情報ｱﾗｰﾑ情報7'、'Z304'：'[KM9000]その他情報ｱﾗｰﾑ情報8'、'Z314'：'[KM9000]その他情報ｱﾗｰﾑ情報9'、'Z324'：'[KM9000]その他情報ｱﾗｰﾑ情報10'、'Z334'：'[KM9000]その他情報注意情報'、'Z344'：'[KM9000]経過時間'、'Z354'：'[KM9000]その他情報用途'、'Z364'：'[KM9000]その他情報工程'、'Z374'：'[KM9000]その他情報動作日、時間'）",
            "左グラフ色（#000000）",
            "左線サイズ（2）",
            "左線タイプ値（'0':点線、'1':破線、'2':実線）",
            "左ポイント色（#000000）",
            "左ポイントサイズ（4）",
            "左ポイントタイプ値（'triangle-down':▼、'triangle':▲、'circle':●、'square':■、'diamond':◆）",
            "右項目（'0'：'工程'、'1'：'経過時間'、'2'：'経過時間(ECUM)'、'3'：'残り時間(除水完了)'、'4'：'残り時間(透析完了)'、'5'：'除水積算値'、'6'：'除水速度'、'7'：'血液循環量'、'8'：'血流量'、'9'：'ＩＰ総量'、'10'：'ＩＰ速度'、'11'：'静脈圧'、'12'：'透析液圧'、'13'：'ＴＭＰ'、'14'：'ﾀﾞｲｱﾗｲｻﾞｰ入口圧'、'15'：'ﾀﾞｲｱﾗｲｻﾞｰ差圧'、'16'：'血液入口～静脈平均圧'、'17'：'ΔＢＶ'、'18'：'バイカーボ濃度'、'19'：'透析液濃度'、'20'：'Ｎａ濃度'、'21'：'透析液温度'、'22'：'透析液流量'、'23'：'漏血量'、'24'：'給液圧（上限）'、'25'：'給液圧（下限）'、'26'：'ＵＦＲ'、'27'：'ＵＦＲ低下率'、'28'：'初期ＵＦＲ測定値'、'29'：'ＴＭＰ補正値'、'30'：'透析運転時間'、'31'：'治療モード'、'32'：'除水目標値'、'33'：'除水速度設定値'、'34'：'透析液温度設定値'、'35'：'透析液流量設定値'、'36'：'血流量設定値'、'37'：'IP速度設定'、'38'：'Kt/V測定値'、'39'：'静脈圧警報点（上限）'、'40'：'静脈圧警報点（下限）'、'41'：'透析液圧警報点(上限)'、'42'：'透析液圧警報点(下限)'、'43'：'ＴＭＰ警報点（上限）'、'44'：'ＴＭＰ警報点（下限）'、'45'：'ダイアライザー入口圧警報点（上限）'、'46'：'ダイアライザー入口圧警報点（下限）'、'47'：'ダイアライザー差圧警報点（上限）'、'48'：'ダイアライザー差圧警報点（下限）'、'49'：'ΔBV低下警報点１'、'50'：'ΔBV低下警報点２'、'51'：'ΔBV変化率警報点'、'52'：'BPM関連データ9'、'53'：'BPM関連データ10'、'54'：'バイカーボ濃度警報点（上限）'、'55'：'バイカーボ濃度警報点（下限）'、'56'：'透析液濃度警報点（上限）'、'57'：'透析液濃度警報点（下限）'、'58'：'Ｎａ濃度警報点(上限)'、'59'：'Ｎａ濃度警報点(下限)'、'60'：'透析液温度警報点（上限）'、'61'：'透析液温度警報点（下限）'、'62'：'漏血量警報'、'63'：'給水圧警報点（上限）'、'64'：'給水圧警報点（下限）'、'65'：'初期ＵＦＲ警報点（上限）'、'66'：'初期ＵＦＲ警報点（下限）'、'67'：'ＵＦＲ低下率警報'、'68'：'Kt/V'、'69'：'運転中の血流量積算値'、'70'：'補液量設定値'、'71'：'補液速度'、'72'：'補液量現在値'、'73'：'補液速度設定値'、'74'：'補液温度'、'75'：'補液温度設定値'、'76'：'濾液速度'、'77'：'荷重計'、'78'：'残り時間(補液完了)'、'79'：'ＵＲＲ'、'80'：'ΔBV変化率'、'81'：'PWI'、'82'：'BPM関連データ1'、'83'：'BPM関連データ2'、'84'：'BPM関連データ3'、'85'：'ΔBVリファレンスエリア上限'、'86'：'ΔBVリファレンスエリア下限'、'87'：'BPM関連データ6'、'88'：'PRR'、'89'：'再循環率測定結果（BVMS連携用）'、'90'：'最高血圧'、'91'：'最低血圧'、'92'：'平均血圧'、'93'：'脈拍'、'94'：'体温'、'95'：'ΔBV5分平均値'、'96'：'ΔBV最大最小を除いた5分平均値'、'97'：'推定血流量'、'98'：'血流量不足率'、'100'：'ΔBV(BVplus)'、'101'：'Ht'、'102'：'LDQb'、'Z11'：'[ACHΣ]治療モード'、'Z21'：'[ACHΣ]工程状態'、'Z31'：'[ACHΣ]除水速度'、'Z41'：'[ACHΣ]血液流量'、'Z51'：'[ACHΣ]シリンジ流量'、'Z61'：'[ACHΣ]ろ過流量'、'Z71'：'[ACHΣ]透析液/ドレン流量'、'Z81'：'[ACHΣ]補液流量'、'Z91'：'[ACHΣ]透析液加温器温度'、'Z101'：'[ACHΣ]補液加温器温度'、'Z111'：'[ACHΣ]現在除水量'、'Z121'：'[ACHΣ]現在血液循環量'、'Z131'：'[ACHΣ]現在ろ過量'、'Z141'：'[ACHΣ]現在透析液/ドレン量'、'Z151'：'[ACHΣ]現在補液量'、'Z161'：'[ACHΣ]治療時間'、'Z171'：'[ACHΣ]シリンジ積算量'、'Z181'：'[ACHΣ]目標除水量'、'Z191'：'[ACHΣ]目標血液循環量'、'Z201'：'[ACHΣ]目標ろ過量'、'Z211'：'[ACHΣ]目標透析液/ドレン量'、'Z221'：'[ACHΣ]目標補液量'、'Z231'：'[ACHΣ]目標治療時間'、'Z241'：'[ACHΣ]脱血圧'、'Z251'：'[ACHΣ]入口圧'、'Z261'：'[ACHΣ]静脈圧'、'Z271'：'[ACHΣ]ろ過圧'、'Z281'：'[ACHΣ]排気圧/2次膜圧'、'Z291'：'[ACHΣ]TMP/TMP1'、'Z301'：'[ACHΣ]TMP2'、'Z311'：'[ACHΣ]差圧'、'Z321'：'[ACHΣ]気泡検知警報'、'Z331'：'[ACHΣ]漏血警報'、'Z341'：'[ACHΣ]加温器警報'、'Z351'：'[ACHΣ]脱血圧警報'、'Z361'：'[ACHΣ]入口圧警報'、'Z371'：'[ACHΣ]静脈圧警報'、'Z381'：'[ACHΣ]ろ過圧警報'、'Z391'：'[ACHΣ]排気圧/2次膜圧警報'、'Z401'：'[ACHΣ]TMP警報'、'Z411'：'[ACHΣ]TMP2警報'、'Z421'：'[ACHΣ]差圧警報'、'Z431'：'[ACHΣ]その他警報'、'Z441'：'[ACHΣ]クエン酸流量'、'Z451'：'[ACHΣ]現在クエン酸量'、'Z12'：'[KM8900]測定値TMP'、'Z22'：'[KM8900]測定値入口圧'、'Z32'：'[KM8900]測定値返血圧'、'Z42'：'[KM8900]測定値2次膜圧(吸着圧)'、'Z52'：'[KM8900]圧力上限警報設定値TMP'、'Z62'：'[KM8900]圧力上限警報設定値入口圧'、'Z72'：'[KM8900]圧力上限警報設定値返血圧'、'Z82'：'[KM8900]圧力上限警報設定値2次膜圧(吸着圧)'、'Z92'：'[KM8900]流量情報BP瞬時流量'、'Z102'：'[KM8900]流量情報PP瞬時流量'、'Z112'：'[KM8900]流量情報DP瞬時流量'、'Z122'：'[KM8900]流量情報BP積算流量'、'Z132'：'[KM8900]流量情報PP積算流量'、'Z142'：'[KM8900]流量情報DP積算流量'、'Z152'：'[KM8900]流量情報除水積算流量'、'Z162'：'[KM8900]流量情報血漿処理目標値'、'Z172'：'[KM8900]その他情報加温器温度'、'Z182'：'[KM8900]その他情報バランス'、'Z192'：'[KM8900]経過時間'、'Z202'：'[KM8900]その他情報アラーム番号'、'Z212'：'[KM8900]その他情報自己診断番号'、'Z222'：'[KM8900]その他情報モード(用途)'、'Z232'：'[KM8900]その他情報工程情報'、'Z13'：'[iQ21]治療経過時間'、'Z23'：'[iQ21]除水速度'、'Z33'：'[iQ21]ろ過ポンプ流量'、'Z43'：'[iQ21]補液ポンプ流量'、'Z53'：'[iQ21]透析液ポンプ流量'、'Z63'：'[iQ21]血液ポンプ流量'、'Z73'：'[iQ21]シリンジポンプ流量'、'Z83'：'[iQ21]除水量積算値'、'Z93'：'[iQ21]ろ過量積算値'、'Z103'：'[iQ21]補液量積算値'、'Z113'：'[iQ21]透析液量積算値'、'Z123'：'[iQ21]血液循環量'、'Z133'：'[iQ21]シリンジポンプ積算値'、'Z143'：'[iQ21]採血圧'、'Z153'：'[iQ21]動脈圧'、'Z163'：'[iQ21]静脈圧'、'Z173'：'[iQ21]ろ過圧'、'Z183'：'[iQ21]TMP'、'Z193'：'[iQ21]分離ポンプ流量'、'Z203'：'[iQ21]返漿ポンプ流量'、'Z213'：'[iQ21]ドレンポンプ流量'、'Z223'：'[iQ21]分離量積算値'、'Z233'：'[iQ21]返漿量積算値'、'Z243'：'[iQ21]ドレン量積算値'、'Z253'：'[iQ21]血漿圧'、'Z263'：'[iQ21]血漿入口圧'、'Z14'：'[KM9000]測定値TMP圧'、'Z24'：'[KM9000]測定値入口圧'、'Z34'：'[KM9000]測定値返血圧'、'Z44'：'[KM9000]測定値ろ過圧'、'Z54'：'[KM9000]測定値浄化器圧'、'Z64'：'[KM9000]設定値TMP圧'、'Z74'：'[KM9000]設定値入口圧'、'Z84'：'[KM9000]設定値返血圧・上限'、'Z94'：'[KM9000]設定値返血圧・下限'、'Z104'：'[KM9000]設定値浄化器圧'、'Z114'：'[KM9000]設定値除水設定値'、'Z124'：'[KM9000]流量情報血液ﾎﾟﾝﾌﾟ指令流量'、'Z134'：'[KM9000]流量情報透析液ﾎﾟﾝﾌﾟ指令流量'、'Z144'：'[KM9000]流量情報補充液ﾎﾟﾝﾌﾟ指令流量'、'Z154'：'[KM9000]流量情報ろ液ﾎﾟﾝﾌﾟ指令流量'、'Z164'：'[KM9000]流量情報血液ﾎﾟﾝﾌﾟ積算流量'、'Z174'：'[KM9000]流量情報透析液ﾎﾟﾝﾌﾟ積算流量'、'Z184'：'[KM9000]流量情報補充液ﾎﾟﾝﾌﾟ積算流量'、'Z194'：'[KM9000]流量情報除水積算流量'、'Z204'：'[KM9000]その他情報加温器温度'、'Z214'：'[KM9000]その他情報除水差分/重量値'、'Z224'：'[KM9000]その他情報初期診断情報'、'Z234'：'[KM9000]その他情報ｱﾗｰﾑ情報1'、'Z244'：'[KM9000]その他情報ｱﾗｰﾑ情報2'、'Z254'：'[KM9000]その他情報ｱﾗｰﾑ情報3'、'Z264'：'[KM9000]その他情報ｱﾗｰﾑ情報4'、'Z274'：'[KM9000]その他情報ｱﾗｰﾑ情報5'、'Z284'：'[KM9000]その他情報ｱﾗｰﾑ情報6'、'Z294'：'[KM9000]その他情報ｱﾗｰﾑ情報7'、'Z304'：'[KM9000]その他情報ｱﾗｰﾑ情報8'、'Z314'：'[KM9000]その他情報ｱﾗｰﾑ情報9'、'Z324'：'[KM9000]その他情報ｱﾗｰﾑ情報10'、'Z334'：'[KM9000]その他情報注意情報'、'Z344'：'[KM9000]経過時間'、'Z354'：'[KM9000]その他情報用途'、'Z364'：'[KM9000]その他情報工程'、'Z374'：'[KM9000]その他情報動作日、時間'）",
            "右グラフ色（#000000）",
            "右線サイズ（2）",
            "右線タイプ値（'0':点線、'1':破線、'2':実線）",
            "右ポイント色（#000000）",
            "右ポイントサイズ（4）",
            "右ポイントタイプ値（'triangle-down':▼、'triangle':▲、'circle':●、'square':■、'diamond':◆）",
        ],
      fields: [
            "monitor_graph_name",
            "left_data_index",
            "left_color",
            "left_line_size",
            "left_line_type_value",
            "left_point_color",
            "left_point_size",
            "left_point_type_value",
            "right_data_index",
            "right_color",
            "right_line_size",
            "right_line_type_value",
            "right_point_color",
            "right_point_size",
            "right_point_type_value",
      ]
    }
  );
  // バイタル・モニタ項目追加マスタ
  csvTemplate.set(
    'mst_add_monitor',
    {
      title: [
            "バイタルモニタ項目名称",
            "バイタル・モニタ区分('1' : バイタル、'2' : モニタ)",
        ],
      fields: [
            "vital_monitor_item_name",
            "vital_monitor_class",
      ]
    }
  );
  // 採血管マスタ
  csvTemplate.set(
    'mst_spitz',
    {
      title: [
            "採血管名",
            "ラベル印字項目",
            "院外院内フラグ('0'：院内、'1'：院外)",
        ],
      fields: [
            "spitz_name",
            "label_print",
            "is_in_hospital",

      ]
    }
  );
  // 検査項目マスタ
  csvTemplate.set(
    'mst_exam_item',
    {
      title: [
            "検査項目名",
            "データ形式('0'：文字、'1'：数値)",
            "単位",
            "正常値区分('0'：共通、'1'：男女)",
            "正常値(上限)(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "正常値(下限)(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "正常値(男性上限)(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "正常値(男性下限)(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "正常値(女性上限)(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "正常値(女性下限)(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "入力小数部桁数(0~9)",
            "入力上限値(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "入力下限値(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "グラフ上限値(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "グラフ下限値(-99999999999999999999.999999999~99999999999999999999.999999999)",
            "仮想端末表示対象区分('0'：表示しない、'1'：表示する)",
            "検査使用区分('0'：検査項目、'1'：システム標準計算項目、'2'：検査計算項目)",
            "属性コード１",
            "属性コード２",
            "属性コード３",
            "連携コード1",
            "連携コード2",
            "連携コード3",
        ],
      fields: [
            "exam_item_name",
            "data_type",
            "unit",
            "normal_value_class",
            "normal_value_upper",
            "normal_value_lower",
            "normal_value_upper_m",
            "normal_value_lower_m",
            "normal_value_upper_w",
            "normal_value_lower_w",
            "input_decimal_figure",
            "input_upper",
            "input_lower",
            "graph_upper",
            "graph_lower",
            "console_class",
            "exam_class",
            "sbt_cd1",
            "sbt_cd2",
            "sbt_cd3",
            "in_hospital_cd1",
            "in_hospital_cd2",
            "in_hospital_cd3",
      ]
    }
  );
  // 一般撮影検査マスタ
  csvTemplate.set(
    'mst_rad_set',
    {
      title: [
            "一般撮影検査名",
            "省略一般撮影検査名",
            "連携コード2",
            "連携コード3",
            "属性コード1",
            "属性コード2",
            "属性コード3",
        ],
      fields: [
            "rad_set_name",
            "rad_set_abb_name",
            "in_hospital_cd2",
            "in_hospital_cd3",
            "sbt_cd1",
            "sbt_cd2",
            "sbt_cd3",

      ]
    }
  );
  // 用法・用語マスタ
  csvTemplate.set(
    'mst_take_medicine',
    {
      title: [
            "用法・用量",
            "リスト選択肢",
        ],
      fields: [
            "list_name",
            "list_details",
      ]
    }
  );
  // メニューグループマスタ
  csvTemplate.set(
    'mst_menu_group',
    {
      title: [
            "メニューグループ名",
        ],
      fields: [
            "menu_group_name",
      ]
    }
  );
  // 休日マスタ
  csvTemplate.set(
    'mst_holiday',
    {
      title: [
            "年",
        ],
      fields: [
            "holiday_y",
      ]
    }
  );
  // 施設イベントカテゴリマスタ
  csvTemplate.set(
    'mst_bbs_kind',
    {
      title: [
            "種別名",
            "デフォルトタイトル",
            "デフォルト内容",

        ],
      fields: [
            "kind_name",
            "default_title",
            "default_contents",
      ]
    }
  );
  // 施設カレンダーレイアウトマスタ
  csvTemplate.set(
    'mst_facility_calendar_layout',
    {
      title: [
            "レイアウト名",
        ],
      fields: [
            "facility_calendar_layout_name",
      ]
    }
  );
  // データリストレイアウトマスタ
  csvTemplate.set(
    'mst_pat_list_layout',
    {
      title: [
            "レイアウト名",
        ],
      fields: [
            "pat_list_layout_name",
      ]
    }
  );
  // 患者経過総合ビューアレイアウトマスタ
  csvTemplate.set(
    'mst_pat_viewer_layout',
    {
      title: [
            "レイアウト名",
        ],
      fields: [
            "layout_name",
      ]
    }
  );
  // 患者カレンダーレイアウトマスタ
  csvTemplate.set(
    'mst_pat_calendar_layout',
    {
      title: [
            "レイアウト名",
        ],
      fields: [
            "pat_calendar_layout_name",
      ]
    }
  );
  // 治療状況レイアウトマスタ
  csvTemplate.set(
    'mst_treatment_status_layout',
    {
      title: [
            "レイアウト名",
            "使用区分(0'：リスト、'1'：マップ)",
        ],
      fields: [
            "layout_name",
            "use_class",
      ]
    }
  );
  // 治療状況透析液調製装置トレンドレイアウトマスタ
  csvTemplate.set(
    'mst_trend_graph_monitor_set',
    {
      title: [
          "テンプレート名",
          "装置('001':DRO、'002':'DAB、003':'DAD、006':'DRY_A、007':'DRY_B')",

        ],
      fields: [
            "monitor_set_name",
            "model",
      ]
    }
  );
  // 治療状況透析液調製装置グラフレイアウトマスタ
  csvTemplate.set(
    'mst_trend_graph_template',
    {
      title: [
          "テンプレート名",
          "装置('001':DRO、'002':'DAB、003':'DAD、006':'DRY_A、007':'DRY_B')",
          "縦軸範囲(右)最大値",
          "縦軸範囲(右)最小値",
          "縦軸範囲(左)最大値",
          "縦軸範囲(左)最小値",
        ],
      fields: [
            "template_name",
            "model",
            "vertical_range_right_max",
            "vertical_range_right_min",
            "vertical_range_left_max",
            "vertical_range_left_min",
      ]
    }
  );
  // 共通定型文マスタ
  csvTemplate.set(
    'mst_com_fixed_phrase',
    {
      title: [
            "定型文",
        ],
      fields: [
            "com_fixed_phrase",
      ]
    }
  );
  // 送信先グループマスタ
  csvTemplate.set(
    'mst_destination_group',
    {
      title: [
            "送信先グループ名",
             // mod #6262 2022-11-02 雛形作成で出力されるCSVの内容が途中で切れている 孟堅　start
             // "メーカー通知('0':選択されてい、'1':選択)",
             "メーカー通知(0：選択しない，1：選択)",
             // mod #6262 2022-11-02 雛形作成で出力されるCSVの内容が途中で切れている　孟堅  end
        ],
      fields: [
            "destination_group_name",
            "is_notice",
      ]
    }
  );
  // 警報通知マスタ
  csvTemplate.set(
    'mst_alarm_notification',
    {
      title: [
        "警報通知名",
        "送信先施設コード",
        "送信先グループコード",
        "通知フラグ(月)(0：選択しない，1：選択)",
        "開始時間(月)(00:00)",
        "終了時間(月)(00:00)",
        "翌日フラグ(月)(0：選択しない，1：選択)",
        "通知フラグ(火)(0：選択しない，1：選択)",
        "開始時間(火)(00:00)",
        "終了時間(火)(00:00)",
        "翌日フラグ(火)(0：選択しない，1：選択)",
        "通知フラグ(水)(0：選択しない，1：選択)",
        "開始時間(水)(00:00)",
        "終了時間(水)(00:00)",
        "翌日フラグ(水)(0：選択しない，1：選択)",
        "通知フラグ(木)(0：選択しない，1：選択)",
        "開始時間(木)(00:00)",
        "終了時間(木)(00:00)",
        "翌日フラグ(木)(0：選択しない，1：選択)",
        "通知フラグ(金)(0：選択しない，1：選択)",
        "開始時間(金)(00:00)",
        "終了時間(金)(00:00)",
        "翌日フラグ(金)(0：選択しない，1：選択)",
        "通知フラグ(土)(0：選択しない，1：選択)",
        "開始時間(土)(00:00)",
        "終了時間(土)(00:00)",
        "翌日フラグ(土)(0：選択しない，1：選択)",
        "通知フラグ(日)(0：選択しない，1：選択)",
        "開始時間(日)(00:00)",
        "終了時間(日)(00:00)",
        "翌日フラグ(日)(0：選択しない，1：選択)",
        "SMS通知先電話番号"
        ],
      fields: [
        "alarm_notification_name",
        "destination_facility_cd",
        "destination_group_cd",
        "is_notice_mon",
        "start_time_mon",
        "end_time_mon",
        "is_next_day_mon",
        "is_notice_tue",
        "start_time_tue",
        "end_time_tue",
        "is_next_day_tue",
        "is_notice_wed",
        "start_time_wed",
        "end_time_wed",
        "is_next_day_wed",
        "is_notice_thu",
        "start_time_thu",
        "end_time_thu",
        "is_next_day_thu",
        "is_notice_fri",
        "start_time_fri",
        "end_time_fri",
        "is_next_day_fri",
        "is_notice_sat",
        "start_time_sat",
        "end_time_sat",
        "is_next_day_sat",
        "is_notice_sun",
        "start_time_sun",
        "end_time_sun",
        "is_next_day_sun",
        "sms_tel"
      ]
    }
  );
  // 日常・定期点検項目マスタ
  csvTemplate.set(
    'mst_mainte_detail',
    {
      title: [
            "用途('1':日常点検、'2':定期点検)",
            "内容1",
            "内容2",
            "内容3",
            "回答パターン 用途:日常点検('0':日常点検) 用途:定期点検('1':定期点検、'2':チェック)",
            "補足コメント有無('0':コメントなし、'1':コメント要)",
            "初期展開テキスト",

        ],
      fields: [
            "mainte_class",
            "mainte_content_1",
            "mainte_content_2",
            "mainte_content_3",
            "ans_pattern",
            "is_cmt",
            "ini_text",
      ]
    }
  );
  // 日常・定期点検項目グループマスタ
  csvTemplate.set(
    'mst_mainte_category',
    {
      title: [
            "レイアウト名",
            "用途('1'：日常点検用、'2'：定期点検用)",
        ],
      fields: [
            "category_name",
            "mainte_class",
      ]
    }
  );
  // 日常・定期点検レイアウトマスタ
  csvTemplate.set(
    'mst_mainte_layout',
    {
      title: [
            "レイアウト名",
            "レイアウトヘッダー",
            "用途('1'：日常点検用、'2'：定期点検用)",
        ],
      fields: [
            "layout_name",
            "layout_header",
            "layout_class",
      ]
    }
  );
  // 定期点検機種別レイアウトマスタ
  csvTemplate.set(
    'mst_mainte_layout_group',
    {
      title: [
            "グループ名",
        ],
      fields: [
            "group_name",
      ]
    }
  );
  // 水質検査種別マスタ
  csvTemplate.set(
    'mst_water_survey_type',
    {
      title: [
            "水質検査種別名",
            "整数部桁数(1)",
            "小数部桁数(1)",
            "単位",
            "結果初期値",
            "結果文字列初期値('0':未満、'1':以下、'2':検出感度以下)",
            "閾値上限(0)",
            "閾値下限(0)",
            "グラフ上限(0)",
            "グラフ下限(0)",
        ],
      fields: [
            "survey_type_name",
            "integer_digits",
            "decimal_digits",
            "unit",
            "initial_value",
            "initial_string",
            "upper_threshold",
            "lower_threshold",
            "graph_upper_limit",
            "graph_lower_limit",
      ]
    }
  );
  // 水質検査箇所マスタ
  csvTemplate.set(
    'mst_water_survey_point',
    {
      title: [
            "水質検査箇所名",
            "連携コード1",
            "連携コード2",
        ],
      fields: [
            "point_name",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
   // 全施設マスタ
  csvTemplate.set(
    'sys_facility',
    {
      title: [
            "医療機関コード",
            "都道府県(' '：' '、'01'：'北海道'、'02'：'青森県'、'03'：'岩手県'、'04'：'宮城県'、'05'：'秋田県'、'06'：'山形県'、'07'：'福島県'、'08'：'茨城県'、'09'：'栃木県'、'10'：'群馬県'、'11'：'埼玉県'、'12'：'千葉県'、'13'：'東京都'、'14'：'神奈川県'、'15'：'新潟県'、'16'：'富山県'、'17'：'石川県'、'18'：'福井県'、'19'：'山梨県'、'20'：'長野県'、'21'：'岐阜県'、'22'：'静岡県'、'23'：'愛知県'、'24'：'三重県'、'25'：'滋賀県'、'26'：'京都府'、'27'：'大阪府'、'28'：'兵庫県'、'29'：'奈良県'、'30'：'和歌山県'、'31'：'鳥取県'、'32'：'島根県'、'33'：'岡山県'、'34'：'広島県'、'35'：'山口県'、'36'：'徳島県'、'37'：'香川県'、'38'：'愛媛県'、'39'：'高知県'、'40'：'福岡県'、'41'：'佐賀県'、'42'：'長崎県'、'43'：'熊本県'、'44'：'大分県'、'45'：'宮崎県'、'46'：'鹿児島県'、'47'：'沖縄県')",
            "施設名",
            "施設コード",
            "短縮施設名",
            "JSDT施設コード",
            "郵便番号",
            "住所",
            "住所カナ",
            "電話番号1",
            "電話番号2",
            "FAX1",
            "FAX2",
        ],
      fields: [
            "medical_institution_cd",
            "prefectures_cd",
            "facility_name",
            "facility_cd",
            "facility_short_name",
            "jsdt_facility_cd",
            "zipcd",
            "address",
            "address_kana",
            "phone_no1",
            "phone_no2",
            "fax_no1",
            "fax_no2",
      ]
    }
  );
  // 職種マスタ
  csvTemplate.set(
    'mst_job',
    {
      title: [
            "職種名",
            "医師フラグ('0'：' '、'1'：'医師')",
            "連携コード1",
        ],
      fields: [
            "job_name",
            "is_doctor",
            "in_hospital_cd_1",
      ]
    }
  );
  // 装置マスタ
  csvTemplate.set(
    'mst_machine',
    {
      title: [
            "装置名",
            "製造番号",
            "バージョン",
            "IPアドレス",
            "ポート(0~65535)",
            "データ収集実施('0'：'データ収集しない'、'1'：'データ収集する')",
            "装置ビューア使用('0'：'使用しない'、'1'：'使用する')",
            "連携コード1",
            "連携コード2",
        ],
      fields: [
            "machine_name",
            "machine_serial",
            "version",
            "ip_address",
            "port",
            "is_ftp",
            "is_va",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
  // ベッドマスタ
  csvTemplate.set(
    'mst_bed',
    {
      title: [
            "ベッド名",
            "VA位置('0'：'両方'、'1'：'左'、'2'：'右'、'3'：'なし')",
            "感染症('0'：'感染症なし'、'1'：'感染症あり')",
            "緊急区分('0'：'通常ベッド'、'1'：'緊急用ベッド')",
            "前体重測定時の自動印刷有無('0'：'印刷しない'、'1'：'印刷する')",
            "後体重測定時の自動印刷有無('0'：'印刷しない'、'1'：'印刷する')",
            "実績確定時の自動印刷有無('0'：'印刷しない'、'1'：'印刷する')",
            "連携コード1",
            "連携コード2",
        ],
      fields: [
            "bed_name",
            "shunt_position",
            "is_infection",
            "emergency_class",
            "is_autoprint_before",
            "is_autoprint_after",
            "is_autoprint_commit",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
  // 車いすマスタ
  csvTemplate.set(
    'mst_wheel_chair',
    {
      title: [
            "車いす名称",
            "重量(kg)",
            "個人所有フラグ(0:なし、1:あり)",
            "連携コード1",
            "連携コード2",
        ],
      fields: [
            "wheel_chair_name",
            "wheel_chair_weight",
            "is_personal",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
      ]
    }
  );
  // 治療記録バイタルグラフマスタ
  csvTemplate.set(
      'mst_vital_graph',
      {
        title: [
              "バイタルグラフ名",
              "線色",
              "線サイズ",
              "線タイプ(dot:点線、dash:破線、solid:実線)",
              "ポイント色",
              "ポイントサイズ",
              "ポイントタイプ(triangle-down:▼、triangle:▲、circle:●、square:■、diamond:◆)",
          ],
        fields: [
              "vital_graph_name",
              "vital_line_color",
              "vital_line_size",
              "vital_line_type_value",
              "vital_point_color",
              "vital_point_size",
              "vital_point_type_value",
        ]
      }
    );
  // 患者イベントサブカテゴリマスタ
  csvTemplate.set(
    'mst_pat_event_sub_category',
    {
      title: [
            "サブカテゴリ名",
            "カテゴリ",
            "利用種別(0:通常、1:VA、2:観察記録、3:紹介状)",
            "テンプレート",
            "利用開始日A(yyyy/mm/dd)",
            "連携コードA-1",
            "連携コードA-2",
            "連携コードA-3",
            "連携コードA-4",
            "利用開始日B(yyyy/mm/dd)",
            "連携コードB-1",
            "連携コードB-2",
            "連携コードB-3",
            "連携コードB-4",
        ],
      fields: [
            "sub_category_name",
            "category_cd",
            "use_type",
            "template_cd",
            "in_hosp_a_startdate",
            "in_hospital_cd_a1",
            "in_hospital_cd_a2",
            "in_hospital_cd_a3",
            "in_hospital_cd_a4",
            "in_hosp_b_startdate",
            "in_hospital_cd_b1",
            "in_hospital_cd_b2",
            "in_hospital_cd_b3",
            "in_hospital_cd_b4",
      ]
    }
  );
  // 装置記録マスタ
  csvTemplate.set(
    'mst_machine_record_control',
    {
      title: [
            "装置記録コード",
            "装置記録メッセージ",
            "表示フラグ('0'：'表示しない'、'1'：'愁訴処置画面のみ表示する'、'2'：'愁訴処置画面+帳票表示する')",
        ],
      fields: [
            "machine_record_cd",
            "machine_record_message",
            "disp_flg",
      ]
    }
  );
  // 愁訴処置マスタ
  csvTemplate.set(
    'mst_complaint',
    {
      title: [
            "愁訴",
            "連携コード1",
            "連携コード2",
            "処置",
            "利用開始日A(yyyymmdd)",
            "連携コードA-1",
            "連携コードA-2",
            "連携コードA-3",
            "連携コードA-4",
            "利用開始日B(yyyymmdd)",
            "連携コードB-1",
            "連携コードB-2",
            "連携コードB-3",
            "連携コードB-4",
        ],
      fields: [
            "complaint_name",
            "in_hospital_cd_1",
            "in_hospital_cd_2",
            "treatment",
            "in_hosp_a_startdate",
            "in_hospital_cd_a1",
            "in_hospital_cd_a2",
            "in_hospital_cd_a3",
            "in_hospital_cd_a4",
            "in_hosp_b_startdate",
            "in_hospital_cd_b1",
            "in_hospital_cd_b2",
            "in_hospital_cd_b3",
            "in_hospital_cd_b4",            
      ]
    }
  );
  // 自己診断判定マスタ
  csvTemplate.set(
    'mst_self_measure_result',
    {
      title: [
        "対象機種",
        "範囲バージョン(下限～上限)",
        "配管自己診断結果{判定('0'：未チェック、'1'：'チェック済み')}",
        "配管漏れ(陰圧)[mmHg]",
        "配管漏れ(陽圧)[mmHg]",
        "除水テスト[mmHg]",
        "バランステス[mmHg]",
        "CF漏れ[mmHg]",
        "CF2漏れ[mmHg]",
        "赤電圧[V]",
        "緑電圧[V]",
        "透析液流量[mL/min]",
        "濃度自己診断結果{判定('0':未チェック、'1':'チェック済み')}",
        "透析液濃度[%]",
        "B原液濃度[%]"
      ],
      fields: [
        "disp_machine_name",
        "ver_up_low",
        "ufrc_result",
        "negativePipeLeakage",
        "positivePipeLeakage",
        "removal",
        "balance",
        "cfLeakage",
        "cf2Leakage",
        "voltageRed",
        "voltageGreen",
        "dialysateFlowRate",
        "concentration_result",
        "dialysateA",
        "dialysateB"
      ],
      explanation:[
        "対象機種説明：対象機種に対応する番号を入力してください。输入格式为{対象機種コード1_対象機種コード2_対象機種コード3_対象機種コード4}。例えば0_5_6_8。",
        "範囲バージョン説明：対象機種と同じ数量です，例えば2～5_5～20_6～30_8～15、～4_5～_6～30_～",
        "自己診断項目説明：指定されたフォーマットに従ってデータを記入してください。入力フォーマットと順序は{判定_不合格下限_注意点下限_注意点上限_注意点上限}です，配管自己診断結果を除く，表头参照。例えば配管漏れ(陰圧)，配管漏れ(陽圧)，除水テスト。",
        "1_20_199_30_19",
        "0_20__30_",
        "7_-5_2_-9_",
      ]
    }
  );

  // 標準医薬品マスタ
  csvTemplate.set(
    'sys_medicine',
    {
      title: [
        "販売名",
        "基準番号(HOTコード)",
        "処方用番号(ＨＯＴ７)",
        "会社識別番号",
        "調剤用番号",
        "物流用番号",
        "ＪＡＮコード",
        "薬価基準収載医薬品コード",
        "個別医薬品コード",
        "レセプト電算処理システムコード(1)",
        "レセプト電算処理システムコード(2)",
        "告示名称",
        "レセプト電算処理システム医薬品名",
        "規格単位",
        "包装形態",
        "包装単位(数)",
        "包装単位(単位)",
        "包装総量(数)",
        "包装総量(単位)",
        "区分",
        "製造会社",
        "販売会社",
        "レコード区分",
        "更新年月日",
        "包装数量(数量)",
        "包装数量(単位)",
        "包装入数(数量)",
        "包装入数(単位)",
        "指示単位",
        "レセ単位",
        "指示単位換算量",
        "レセ単位換算量",
        "指示単位小数部桁数",
        "レセ単位小数部桁数"
      ],
      fields: [
        "sales_name",
        "standard_no",
        "prescription_no",
        "company_no",
        "dispensing_no",
        "logistics_no",
        "jan_cd",
        "drug_price_standard_cd",
        "standard_medicine_cd",
        "receipt_cd_1",
        "receipt_cd_2",
        "notice_name",
        "receipt_medicine_name",
        "standard_unit",
        "pkg_presentation",
        "pkg_amount",
        "pkg_unit",
        "pkg_total_amount",
        "pkg_total_unit",
        "usage_category_class",
        "manufacture_company",
        "sales_company",
        "record_class",
        "standard_up_date",
        "pkg_qty_quantity",
        "pkg_qty_unit",
        "pkg_qty_per_carton_quantity",
        "pkg_qty_per_carton_unit",
        "unit",
        "unit_second",
        "unit_converted_amount",
        "unit_converted_amount_second",
        "unit_decimal_point",
        "unit_decimal_point_second"
      ]
    }
  );

export default csvTemplate;
