-- 職種マスタ
TRUNCATE TABLE mst_job;
INSERT INTO
  mst_job
  (
    job_cd
    , facility_cd
    , job_name
    , is_doctor
    , is_disp
    , is_del
  )
VALUES
  (
	  1
	  ,'009999'
	  , '医師'
	  , '1'
	  , '1'
	  , '0'
  )
  ,(
	  2
	  ,'009999'
    , '看護師'
    , '0'
    , '1'
    , '0'
  )
  ,(
	  3
	  ,'009999'
    , '臨床工学技士'
    , '0'
    , '1'
    , '0'
  )
  ,(
	  4
	  ,'009999'
    , '医師'
    , '1'
    , '1'
    , '1'
  )
  ,(
	  5
	  ,'009999'
    , '医師'
    , '1'
    , '0'
    , '0'
  )
  ,(
    6
    , '999999'
    , '医師999999'
    , '1'
    , '1'
    , '0'
  )
;
