TRUNCATE TABLE mst_machine_record;
INSERT INTO
  mst_machine_record
  (
    machine_record_cd
    , machine_record_message
    , is_default
    , log_class
    , target_model
  )
VALUES
  (
    '0050'
    , '投与薬剤'
    , '1'
    , '1'
    , '1'
  ),
    (
    '0060'
    , '酸素吸入開始'
    , '1'
    , '2'
    , '3'
  ),
    (
    '0061'
    , '酸素吸入終了'
    , '1'
    , '4'
    , '6'
  ),
    (
    '0101'
    , '血圧測定'
    , '1'
    , '3'
    , '2'
  ),
    (
    '0102'
    , '体温測定'
    , '1'
    , '5'
    , '4'
  ),
    (
    '0103'
    , 'ケア'
    , '0'
    , '1'
    , '1'
  ),
    (
    '0104'
    , '透析前血圧'
    , '0'
    , '2'
    , '3'
  ),
    (
    '0105'
    , '透析後血圧'
    , '0'
    , '2'
    , '1'
  ),
    (
    '0109'
    , '引き残し量'
    , '0'
    , '6'
    , '4'
  ),
    (
    '0201'
    , 'ＬＣＤオープン'
    , '0'
    , '3'
    , '6'
  )
