insert into
  mst_user
  (
    user_id
    , user_settings
    , reg_date
    , up_date
  )
VALUES
  (
    2
    , '{"personal_settings": [{"values": [{"value": 1, "setting_identifier": "1"}], "tab_define_cd": 1}]}'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
  )
  ,(
    3
    , '{"personal_settings": [{"values": [{"value": 1, "setting_identifier": "1"}], "tab_define_cd": 1}]}'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
  )
  ,(
    4
    , '{"personal_settings": [{"values": [{"value": 1, "setting_identifier": "1"}], "tab_define_cd": 1}]}'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
  )
  ,(
    5
    , '{"personal_settings": [{"values": [{"value": 1, "setting_identifier": "1"}], "tab_define_cd": 1}]}'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
  )
;

delete from mnt_notification_message;

insert into
  mnt_notification_message
  (
    notification_message_no
    , "content"
    , additional_info
    , reg_date
    , up_date
    , facility_cd
  )
VALUES
  (
    10
    , 'テストメッセージ内容1'
    , '{"item01": "value01", "item02": "value02"}'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    20
    , 'テストメッセージ内容2'
    , '{"item01": "value01"}'
    , '2019-08-05 12:00:01.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    30
    , 'テストメッセージ内容3'
    , '{"item01": "value01"}'
    , '2019-08-05 12:00:02.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    40
    , 'テストメッセージ内容4'
    , '{"item01": "value01"}'
    , '2019-08-05 12:00:03.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    50
    , 'テストメッセージ内容5'
    , '{"item01": "value01"}'
    , '2019-08-05 12:00:04.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
;

insert into
  mnt_notification_status
  (
    notification_message_no
    , user_id
    , is_notified
    , is_read
    , reg_date
    , up_date
    , facility_cd
  )
VALUES
  (
    10
    , 2
    , '0'
    , '0'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    10
    , 3
    , '0'
    , '0'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    20
    , 2
    , '1'
    , '0'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    30
    , 2
    , '0'
    , '0'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    40
    , 2
    , '1'
    , '1'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    50
    , 2
    , '0'
    , '1'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
  ,(
    10
    , 4
    , '0'
    , '0'
    , '2019-08-05 12:00:00.000'
    , '2019-08-05 13:00:00.000'
    , '000001'
  )
;
