INSERT INTO ntss.sys_report_setting (function_cd,report_setting_no,function_name,print_report_class,is_disp,is_del,reg_date,up_date) VALUES 
('00401',401,'患者経過総合ビューア','[{"disp_status":"0","report_class":"2,3"},{"disp_status":"1","report_class":"1,2,3,8,9,10"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('00601',601,'治療記録','[{"disp_status":"0","report_class":"2,3,7,8,10"},{"disp_status":"1","report_class":"1,2,3,7,8,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('00701',701,'患者情報','[{"disp_status":"0","report_class":"2,3,10"},{"disp_status":"1","report_class":"2,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('00801',801,'データリスト','[{"disp_status":"0","report_class":"2,3"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('00901',901,'スケジュール表','[{"disp_status":"0","report_class":"2,3,7,8"},{"disp_status":"1","report_class":"1,2,3,7,8,9,10"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('01001',1001,'装置設定','[{"disp_status":"0","report_class":"2,3"},{"disp_status":"1","report_class":"2,3,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('01101',1101,'治療状況リスト','[{"disp_status":"0","report_class":"2,3,7,8"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('01201',1201,'治療状況マップ','[{"disp_status":"0","report_class":"2,3,7,8"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('01301',1301,'体重計','[{"disp_status":"0","report_class":"2,3,7,8"},{"disp_status":"1","report_class":"2,3,7,8,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('01401',1401,'体重計測定記録','[{"disp_status":"0","report_class":"2,3,7"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
;
INSERT INTO ntss.sys_report_setting (function_cd,report_setting_no,function_name,print_report_class,is_disp,is_del,reg_date,up_date) VALUES 
('01501',1501,'チェックリスト','[{"disp_status":"0","report_class":"2,3,7"},{"disp_status":"1","report_class":"1,2,7,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('01601',1601,'観察記録','[{"disp_status":"0","report_class":"2,3"},{"disp_status":"1","report_class":"1,2,7,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('01801',1801,'検査結果','[{"disp_status":"0","report_class":"2,3,10"},{"disp_status":"1","report_class":"1,2,9,10"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('02101',2101,'検査依頼','[{"disp_status":"0","report_class":"2,3,8,10"},{"disp_status":"1","report_class":"2,9,10"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('02201',2201,'一般撮影検査依頼','[{"disp_status":"0","report_class":"2,3,8,10"},{"disp_status":"1","report_class":"2,9,10"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('02301',2301,'患者グループ','[{"disp_status":"1","report_class":"2,3"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('02401',2401,'患者カレンダ','[{"disp_status":"0","report_class":"2,3"},{"disp_status":"1","report_class":"1,2,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('02501',2501,'在宅透析指示','[{"disp_status":"0","report_class":"2,3"},{"disp_status":"1","report_class":"2,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('02701',2701,'患者イベント','[{"disp_status":"0","report_class":"3"},{"disp_status":"1","report_class":"1,2,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('02801',2801,'指示受け承認','[{"disp_status":"0","report_class":"2,3"},{"disp_status":"1","report_class":"2,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
;
INSERT INTO ntss.sys_report_setting (function_cd,report_setting_no,function_name,print_report_class,is_disp,is_del,reg_date,up_date) VALUES 
('02901',2901,'処方','[{"disp_status":"0","report_class":"2,3"},{"disp_status":"1","report_class":"2,8,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('03001',3001,'紹介状（患者未選択）','[{"disp_status":"0","report_class":"2,3"},{"disp_status":"1","report_class":"2,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('03201',3201,'水質検査','[{"disp_status":"0","report_class":"3,7,10"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('03301',3301,'定期点検','[{"disp_status":"0","report_class":"7"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('03401',3401,'日常点検','[{"disp_status":"0","report_class":"3,7,10"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('03601',3601,'患者情報共有','[{"disp_status":"1","report_class":"2,3,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('03701',3701,'施設カレンダ','[{"disp_status":"0","report_class":"3,7,10"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
,('03901',3901,'9分割グラフ','[{"disp_status":"0","report_class":"3"},{"disp_status":"1","report_class":"2,9"}]','1','0','2020-12-12 09:30:00.000','2020-12-12 09:30:00.000')
;