@echo off
rem Update.batを利用する、アップグレードのタスクスケジューラを作成します。

rem 管理者権限を取得します(XCOPYを利用します)
%1 mshta vbscript:CreateObject("Shell.Application").ShellExecute("cmd.exe","/c %~s0 ::","","runas",1)(window.close)&&exit
cd /d "%~dp0"

echo ================================================================================
echo Update.batを利用する、アップグレードのタスクスケジューラを作成します。
echo --------------------------------------------------------------------------------
echo.

rem 自動更新BATファイルの存在判断
set BatFile=%~dp0Update.bat
if not exist "%BatFile%" (
echo --------------------------------------------------------------------------------
echo 自動更新BATファイル[%BatFile%]が存在しません。確認してください。
echo --------------------------------------------------------------------------------
echo.
pause
exit /b 1
)

rem スクスケジューラを作成します
schtasks /create /TN "ReportViewServiceUpate" /RU SYSTEM /SC ONSTART /TR %BatFile%
if %errorlevel% == 0 (
echo --------------------------------------------------------------------------------
echo タスクスケジューラ作成に成功しました。
echo --------------------------------------------------------------------------------
echo.
) else (
echo --------------------------------------------------------------------------------
echo タスクスケジューラ作成に失敗しました。
echo システム管理者に連絡してください。
echo --------------------------------------------------------------------------------
echo.
)

pause
