//----------------------------------------------------------------------------------------------------
// ログ処理
//  ※Singleton
//----------------------------------------------------------------------------------------------------
using System;
using System.Collections;
using System.Collections.Generic;
using System.Text;
using System.Text.RegularExpressions;
using System.Threading;
using System.Reflection;
using NKKWebAccessLib;

#if DEBUG
using System.Diagnostics;
#endif

//----------------------------------------------------------------------------------------------------
//  TdcLib名前空間
//----------------------------------------------------------------------------------------------------
using TdcLib;

//----------------------------------------------------------------------------------------------------
//  NKKLogging名前空間
//----------------------------------------------------------------------------------------------------
namespace NKKLoggingLib
{
    #region デリゲート定義
    //----------------------------------------------------------------------------------------------------
    /// <summary>
    /// ログファイル初回書込通知用デリゲート定義
    /// </summary>
    /// <param name="strLogFileName">ベースオブジェクト</param>
    /// <returns>書き込む内容</returns>
    //----------------------------------------------------------------------------------------------------
    public delegate String dgtTdcLoggingFirstWrite(String strLogFileName);
    //----------------------------------------------------------------------------------------------------
    #endregion

    //----------------------------------------------------------------------------------------------------
    /// <summary>
    /// ログ処理用クラス
    ///   指定したログ格納先フォルダにログファイルを保存する
    ///   ログファイル名([strLogExt]_YYYYMMDD.LOG：YYYYMMDDファイル作成日)
    /// </summary>
    //----------------------------------------------------------------------------------------------------
    public class NKKLogging
    {

        #region ログ情報クラス

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ履歴情報定義
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private struct LOG_INFO
        {

            #region スタテイック変数定義

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// 通常モード時：ログ識別子
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public String strLogExt;
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ発生日時
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public DateTime dtLogDateTime;
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ内容
            /// </summary>
            public String strLogData;
            //----------------------------------------------------------------------------------------------------

            #endregion

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ情報 コンストラクタ
            /// </summary>
            /// <param name="strLogExt">ログ識別子</param>
            /// <param name="dtLogDateTime">ログ発生日時</param>
            /// <param name="strLogData">ログ内容</param>
            //----------------------------------------------------------------------------------------------------
            public LOG_INFO(String strLogExt, DateTime dtLogDateTime, String strLogData)
            {
                this.strLogExt = strLogExt;
                this.dtLogDateTime = dtLogDateTime;
                this.strLogData = strLogData;
            }
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ToString()定義
            /// </summary>
            /// <returns></returns>
            //----------------------------------------------------------------------------------------------------
            public override String ToString()
            {
                String strret = String.Empty;

                strret += this.dtLogDateTime.ToString("[yyyy/MM/dd HH:mm:ss:ffff]");
                strret += ",";
                strret += this.strLogData;

                return (strret);
            }
            //----------------------------------------------------------------------------------------------------
        }
        //----------------------------------------------------------------------------------------------------

        #endregion


        #region ログ記録用スレッドクラス

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ記録用スレッドクラス
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private class LoggingThread
        {

            #region プライベート変数定義

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ記録拡張子
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            private String m_strLogExt = String.Empty;

            private String m_strErrorLogExt = String.Empty;
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログファイル格納先フォルダ
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            private String m_strLogFolder = String.Empty;
            // #6843 ログアップロード LL start
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ送信時刻(HHmm)
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            //private String m_logTime = String.Empty;
            // #6843 ログアップロード LL end
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ情報保持キュー
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            private Queue m_queLogInfo = null;
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ロック回避用ログ情報保持キュー
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            private Queue m_queLogInfoBak = null;
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// スレッド終了フラグ
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            private Boolean m_bFinish = false;
            //----------------------------------------------------------------------------------------------------

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ記録エンコーディング(既定値：UTF-8)
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            //private System.Text.Encoding m_Enc = System.Text.Encoding.GetEncoding("Shift_JIS");
            private System.Text.Encoding m_Enc = System.Text.Encoding.GetEncoding("UTF-8");
            //----------------------------------------------------------------------------------------------------

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// 初回ログ記録実施済みフラグ
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            private Boolean m_bFirstWriteLog = false;
            //----------------------------------------------------------------------------------------------------
            #endregion

            #region イベントハンドラー定義

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// 初回ログ記録イベントハンドラー
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            private dgtTdcLoggingFirstWrite m_FirstWriteEvent = null;
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ記録開始イベントハンドラー
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public AutoResetEvent m_LogWriteEvent = null;
            //----------------------------------------------------------------------------------------------------

            #endregion

            #region パブリックプロパティ

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ記録識別子設定/参照用プロパティ
            /// ※内部エラー発生時の記録先使用する
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public String LogExt
            {
                get { return (this.m_strLogExt); }
                set { this.m_strLogExt = value; }
            }

            public String ErrorLogExt
            {
                get { return (this.m_strErrorLogExt); }
                set { this.m_strErrorLogExt = value; }
            }
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログファイル格納先フォルダ参照/設定用プロパティ
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public String LogFolder
            {
                get { return (this.m_strLogFolder); }
                set { this.m_strLogFolder = value; }
            }

            // #6843 ログアップロード LL start
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ送信時刻(HHmm)
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            //public String LogTime
            //{
            //    get { return (this.m_logTime); }
            //    set { this.m_logTime = value; }
            //}
            // #6843 ログアップロード LL end

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ記録エンコーディング参照/設定用プロパティ
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public System.Text.Encoding Encoding
            {
                get { return (this.m_Enc); }
                set { this.m_Enc = value; }
            }
            //----------------------------------------------------------------------------------------------------

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// 初回ログ記録イベントハンドラー参照/設定用プロパティ
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public dgtTdcLoggingFirstWrite FirstWriteEvent
            {
                get { return (this.m_FirstWriteEvent); }
                set { this.m_FirstWriteEvent = value; }
            }
            //----------------------------------------------------------------------------------------------------

            #endregion

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ記録用スレッドクラス コンストラクタ
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public LoggingThread()
            {
                // 各クラスの構築
                this.m_LogWriteEvent = new AutoResetEvent(false);
                this.m_queLogInfo = new Queue();
                this.m_queLogInfoBak = new Queue();
            }
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ記録用スレッドクラス デストラクタ
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public void Dispose()
            {
                try
                {
                    // ロック回避用ログ情報保持キューに内容がある場合
                    while (0 < this.m_queLogInfoBak.Count)
                    {
                        // ログ情報保持キューへロック回避用ログ情報保持キューのログ内容を移動
                        this.m_queLogInfo.Enqueue(this.m_queLogInfoBak.Dequeue());
                    };

                    // ログ情報保持キューに内容がある場合
                    while (0 < this.m_queLogInfo.Count)
                    {
                        // 全てのログをファイルに記録する
                        this.WriteLog((LOG_INFO)this.m_queLogInfo.Dequeue());

                        // 他のスレッドが処理できるように本スレッドの処理を中断する
                        Thread.Sleep(0);
                    };
                }
                catch
                {
                }
                finally
                {
                }
            }
            //----------------------------------------------------------------------------------------------------


            #region プライベートメソッド

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ書き込み関数
            /// </summary>
            /// <param name="LogInfo">ログ情報</param>
            /// <returns>true：成功/false：失敗</returns>
            //----------------------------------------------------------------------------------------------------
            private bool WriteLog(LOG_INFO LogInfo)
            {
                bool bret = false;

                try
                {
                    // ログ記録先フォルダ
                    String strfoldername = this.m_strLogFolder;

                    // ログファイル名作成
                    String strfilename = String.Empty;
                    if (String.IsNullOrEmpty(LogInfo.strLogExt) == false)
                    {
                        // mod #9696 アプリケーションログのパスとファイル名の修正。 donghao start
                        // ログ識別子がある場合
                        //strfilename = LogInfo.strLogExt;
                        if ( !"BloodPurify".Equals(Assembly.GetEntryAssembly()?.GetName().Name) && !"LayoutDesigner".Equals(Assembly.GetEntryAssembly()?.GetName().Name))
                        {
                            if (!String.IsNullOrEmpty(NKKWebAccess.FacilityCd)) {

                                strfilename = NKKWebAccess.FacilityCd + "_" + LogInfo.strLogExt;
                            }
                            else
                            {
                                strfilename = LogInfo.strLogExt;
                            }
                        }
                        else
                        {
                            strfilename = LogInfo.strLogExt;
                        }
                        // mod #9696 アプリケーションログのパスとファイル名の修正。 donghao end

                        strfilename += "_";
                    }
                    // mod #9696 アプリケーションログのパスとファイル名の修正。 limingzhe start
                    else
                    {
                        if (!String.IsNullOrEmpty(NKKWebAccess.FacilityCd))
                        {

                            strfilename = NKKWebAccess.FacilityCd + "_StatisticsTool_" + System.Net.Dns.GetHostName() + "_";
                        }
                        else
                        {
                            strfilename = "StatisticsTool_" + System.Net.Dns.GetHostName() + "_";
                        }
                    }
                    // mod #9696 アプリケーションログのパスとファイル名の修正。 limingzhe end

                    // #6843 ログアップロード LL start
                    //if ("ViewSync".Equals(LogInfo.strLogExt) && LogTime.CompareTo(DateTime.Now.ToString("HHmm")) <= 0)
                    //{
                    //    strfilename += DateTime.Now.AddDays(1).ToString("yyyyMMdd");
                    //}
                    //else
                    //{
                    //    strfilename += DateTime.Now.ToString("yyyyMMdd");
                    //}
                    // #6843 ログアップロード LL end

                    // #8510 FNSiViewSyncServiceのログが翌日の日付になる　start
                    strfilename += DateTime.Now.ToString("yyyyMMdd");
                    // #8510 FNSiViewSyncServiceのログが翌日の日付になる　end
                    strfilename += ".log";

                    // ログ保存先フォルダチェック
                    if (System.IO.Directory.Exists(strfoldername) == false)
                    {
                        // 存在しない場合

                        // ログ保存先フォルダの作成
                        System.IO.Directory.CreateDirectory(strfoldername);
                    }

                    // 初回ログ記録イベント処理チェック
                    String strfirstwritedata = String.Empty;
                    if (this.FirstWriteEvent != null)
                    {
                        // ログファイルの有無チェック、または初回ログ記録実施済みフラグチェック
                        if (System.IO.File.Exists(strfoldername + strfilename) == false || m_bFirstWriteLog == false)
                        {
                            // 存在しない、または初回ログ記録を行っていない場合

                            // 初回ログ記録イベント処理(ログの先頭に記録する情報を取得)
                            strfirstwritedata = this.FirstWriteEvent(strfoldername + strfilename);
                            if (String.IsNullOrEmpty(strfirstwritedata) == false)
                            {
                                // ログの先頭に記録する情報
                                strfirstwritedata += System.Environment.NewLine;
                            }

                            // 初回ログ記録実施済み
                            this.m_bFirstWriteLog = true;
                        }
                    }

                    // ログ末尾にCRLFがない場合は付加
                    String strlog = strfirstwritedata + LogInfo.ToString();
                    if (strlog.EndsWith(System.Environment.NewLine) == false)
                    {
                        strlog += System.Environment.NewLine;
                    }

                    // 記録情報をバイト変換
                    byte[] bbuff = this.Encoding.GetBytes(strlog);

                    // ファイルに追記
                    System.IO.FileStream fs = new System.IO.FileStream(strfoldername + strfilename, System.IO.FileMode.Append, System.IO.FileAccess.Write, System.IO.FileShare.ReadWrite);
                    fs.Write(bbuff, 0, bbuff.Length);

                    // ファイルを閉じる
                    fs.Close();

                    bret = true;
                }
                catch (Exception ex)
                {
#if DEBUG
                    Trace.WriteLine(String.Format("NKKLogging.LoggingThread.WriteLog Error:{0}", ex.ToString()));
#endif
                    //// ログ記録
                    //this.AddLogInfo(this.LogExt, DateTime.Now, String.Format("NKKLogging.LoggingThread.WriteLog(),Error,{0}", Ex.Message));
                }

                return (bret);
            }
            //----------------------------------------------------------------------------------------------------

            #endregion

            #region パブリックメソッド

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ内容を追加する
            /// </summary>
            /// <param name="strLogExt">ログ識別子</param>
            /// <param name="dtLogDateTime">ログ発生日時</param>
            /// <param name="strLogData">ログ内容</param>
            //----------------------------------------------------------------------------------------------------
            public void AddLogInfo(String strLogExt, DateTime dtLogDateTime, String strLogData)
            {
                // ログ情報保持キューのロックチェック(10ms待ち)
                if (Monitor.TryEnter(this.m_queLogInfo.SyncRoot, 10))
                {
                    // ロックされていない場合

                    // ロック回避用ログ保持キューのロックチェック
                    lock (this.m_queLogInfoBak.SyncRoot)
                    {
                        // ロック回避用ログ情報保持キューに内容がある場合
                        while (0 < this.m_queLogInfoBak.Count)
                        {
                            // ログ情報保持キューへロック回避用ログ情報保持キューのログ内容を移動
                            this.m_queLogInfo.Enqueue(this.m_queLogInfoBak.Dequeue());
                        }
                    }

                    try
                    {
                        // ログ情報保持キューへログ内容を追加
                        this.m_queLogInfo.Enqueue(new LOG_INFO(strLogExt, dtLogDateTime, strLogData));
                    }
                    finally
                    {
                        // ロック解除
                        Monitor.Exit(this.m_queLogInfo.SyncRoot);
                    }
                }
                else
                {
                    // ロックされている場合

                    // ロック回避用ログ情報保持キューのロック
                    lock (this.m_queLogInfoBak.SyncRoot)
                    {
                        // ログ内容をロック回避用ログ情報保持キューへ追加
                        this.m_queLogInfoBak.Enqueue(new LOG_INFO(strLogExt, dtLogDateTime, strLogData));
                    }
                }

                // スレッドに対してログの書き込み開始を通知
                this.m_LogWriteEvent.Set();
            }
            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ処理を終了する
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public void StopLogThread()
            {
                // 終了フラグをセットする
                this.m_bFinish = true;

                // スレッドに対してログの書き込み開始を通知
                this.m_LogWriteEvent.Set();
            }
            //----------------------------------------------------------------------------------------------------

            #endregion

            #region スレッド呼び出し関数定義

            //----------------------------------------------------------------------------------------------------
            /// <summary>
            /// ログ処理スレッド 実体
            /// </summary>
            //----------------------------------------------------------------------------------------------------
            public void DoWork()
            {
                try
                {
                    // 作業用のキュー
                    Queue queloginfo = null;
                    while (true)
                    {
                        // 書き込み処理開始指示があるまで待つ
                        this.m_LogWriteEvent.WaitOne();

                        // スレッド終了の場合
                        if (this.m_bFinish == true)
                            // 処理を抜ける
                            break;

                        // ログ情報保持キューをロック
                        lock (this.m_queLogInfo.SyncRoot)
                        {
                            // 現在までのログ情報を作業用のキューへコピー
                            queloginfo = (Queue)this.m_queLogInfo.Clone();

                            // ログ情報保持キューをクリア
                            this.m_queLogInfo.Clear();
                        }

                        // 作業用キューの内容がある場合
                        while (0 < queloginfo.Count)
                        {
                            // ファイルに記録
                            this.WriteLog((LOG_INFO)queloginfo.Dequeue());

                            // 他のスレッドが処理できるように本スレッドの処理を中断する
                            Thread.Sleep(0);
                        };

                        // 作業用キューの破棄
                        queloginfo.Clear();
                        queloginfo = null;
                    };
                }
                catch (Exception ex)
                {
                    // ログ記録
                    this.WriteLog(new LOG_INFO(this.LogExt, DateTime.Now,
                        String.Format("{0}.{1},error:{2}", this.GetType().Name, MethodBase.GetCurrentMethod().Name, ex.Message)));
                }
                finally
                {
                }
            }
            //----------------------------------------------------------------------------------------------------

            #endregion

        }
        //----------------------------------------------------------------------------------------------------

        #endregion


        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ種別
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public enum LOGGING_CLASS
        {
            INFO = 0,
            DEBUG,
            ERROR
        }
        //----------------------------------------------------------------------------------------------------
        private static readonly String[] LOGGING_CLASS_TEXT = { "[INFO ]", "[DEBUG]", "[ERROR]" };
        //----------------------------------------------------------------------------------------------------

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 圧縮ログファイルのパスワード
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String ZIP_PASSWORD { get; set; } = "nkk";
        //----------------------------------------------------------------------------------------------------

        #region プライベート変数定義

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 内部保持クラスオブジェクト
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private static volatile NKKLogging m_Instance;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ロックオブジェクト
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private static object m_syncRoot = new Object();
        //----------------------------------------------------------------------------------------------------

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ処理用スレッドクラス
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private LoggingThread m_LoggingThread = null;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ処理スレッドオブジェクト
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private Thread m_Thread = null;
        //----------------------------------------------------------------------------------------------------

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される施設コード
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strFacilityCd = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される利用者Id
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strAccountId = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるセッションId
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strSessionId = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるデバイス番号(デバイスエッジ番号や体重計番号等)
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strDeviceNo = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるデバイス製造番号(デバイスエッジ番号や体重計番号等)
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strDeviceSerialNo = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される装置型式(透析装置)
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strMachineType = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される装置製造番号(透析装置)
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strMachineSerialNo = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるEC2識別
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strEC2Id = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される内部患者ID
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strPatId = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるSQL名
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strSQL = String.Empty;
        //----------------------------------------------------------------------------------------------------

        #endregion

        #region プライベートメソッド(コンストラクタ/デストラクタ)

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ処理用クラス コンストラクタ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private NKKLogging()
        {
            // ログ処理用スレッドクラス構築
            this.m_LoggingThread = new LoggingThread();

            // ログフォルダ格納先設定(既定：実行プログラム下のLOGフォルダ)
            this.LogFolder = String.Empty;

            // ログ処理スレッド構築、及び処理開始
            this.m_Thread = new Thread(this.m_LoggingThread.DoWork);
            this.m_Thread.Name = "ログ記録処理スレッド";
            this.m_Thread.IsBackground = false;
            this.m_Thread.Start();
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ処理用クラス デストラクタ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private void Dispose()
        {
            // スレッドが終了するまで待つ
            while (true)
            {
                // スレッドの終了を指示
                this.m_LoggingThread.StopLogThread();

                // スレッドが終了した場合
                if (this.m_Thread.IsAlive == false)
                    // 処理を抜ける
                    break;

                // 他のスレッドが処理できるように本スレッドの処理を中断する
                Thread.Sleep(0);
            };

            // ログ処理用スレッドクラス破棄
            this.m_LoggingThread.Dispose();
        }
        //----------------------------------------------------------------------------------------------------

        #endregion

        #region パブリックアクセスメソッド

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ処理オブジェクト取得
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public static NKKLogging GetInstance()
        {
            if (m_Instance == null)
            {
                lock (m_syncRoot)
                {
                    if (m_Instance == null)
                        m_Instance = new NKKLogging();
                }
            }

            return (m_Instance);
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ処理オブジェクト破棄
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public static void DeleteInstance()
        {
            if (m_Instance != null)
            {
                lock (m_syncRoot)
                {
                    if (m_Instance != null)
                        m_Instance.Dispose();

                    m_Instance = null;
                }
            }
        }
        //----------------------------------------------------------------------------------------------------

       #endregion

       #region パブリックプロパティ

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログファイル格納先フォルダの参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String LogFolder
        {
            get { return (this.m_LoggingThread.LogFolder); }
            set
            {
                String strfolder = value;

                // ログ保存先フォルダの指定チェック
                if (String.IsNullOrEmpty(strfolder) == true)
                {
                    // 未指定

                    // 未指定の場合は実行ファイルの格納先\LOGフォルダとする
                    //strfolder = Application.StartupPath;
                    strfolder = AppDomain.CurrentDomain.BaseDirectory;
                    if (strfolder.EndsWith("\\") == false)
                        strfolder += "\\";
                    strfolder += "LOG";
                }

                // 末尾の\付加
                if (strfolder.EndsWith("\\") == false)
                    strfolder += "\\";

                // ログファイル保存先を設定する             
                this.m_LoggingThread.LogFolder = strfolder;
            }
        }

        // #6843 ログアップロード LL start
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ送信時刻(HHmm)
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        //public String LogTime
        //{
        //    get { return (this.m_LoggingThread.LogTime); }
        //    set { this.m_LoggingThread.LogTime = value; }
        //}
        // #6843 ログアップロード LL end

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ記録エンコーディング参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public System.Text.Encoding Encoding
        {
            get { return (this.m_LoggingThread.Encoding); }
            set { this.m_LoggingThread.Encoding = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 初回ログ記録イベントハンドラー参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public dgtTdcLoggingFirstWrite FirstWriteEvent
        {
            get { return (this.m_LoggingThread.FirstWriteEvent); }
            set { this.m_LoggingThread.FirstWriteEvent = value; }
        }
        //----------------------------------------------------------------------------------------------------

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログ記録識別子参照/設定用プロパティ
        /// ※記録先使用する
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String LogExt
        {
            get { return (this.m_LoggingThread.LogExt); }
            set { this.m_LoggingThread.LogExt = value; }
        }

        public String ErrorLogExt
        {
            get { return (this.m_LoggingThread.ErrorLogExt); }
            set { this.m_LoggingThread.ErrorLogExt = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される施設コード参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String FacilityCd
        {
            get { return (this.m_strFacilityCd); }
            set { this.m_strFacilityCd = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される利用者Id参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String AccountId
        {
            get { return (this.m_strAccountId); }
            set { this.m_strAccountId = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるセッションId参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String SessionId
        {
            get { return (this.m_strSessionId); }
            set { this.m_strSessionId = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるシステム番号参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String DeviceNo
        {
            get { return (this.m_strDeviceNo); }
            set { this.m_strDeviceNo = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるデバイス製造番号(デバイスエッジ番号や体重計番号等)参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String DeviceSerialNo
        {
            get { return this.m_strDeviceSerialNo; }
            set { this.m_strDeviceSerialNo = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される装置型式(透析装置)参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String MachineType
        {
            get { return this.m_strMachineType; }
            set { this.m_strMachineType = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される装置製造番号(透析装置)参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String MachineSerialNo
        {
            get { return this.m_strMachineSerialNo; }
            set { this.m_strMachineSerialNo = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるEC2識別参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String EC2ID
        {
            get { return this.m_strEC2Id; }
            set { this.m_strEC2Id = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録される内部患者ID参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String PatID
        {
            get { return this.m_strPatId; }
            set { this.m_strPatId = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログに記録されるSQL名参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String SQL
        {
            get { return this.m_strSQL; }
            set { this.m_strSQL = value; }
        }
        //----------------------------------------------------------------------------------------------------

        #endregion

        #region パブリックメソッド

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログを追加する(画面コードなし版)
        /// </summary>
        /// <param name="dtLogDateTime">ログ発生日時</param>
        /// <param name="strServiceName">サービス名</param>
        /// <param name="LoggingClass">ログ種別</param>
        /// <param name="strLogMessage">ログ内容</param>
        //----------------------------------------------------------------------------------------------------
        public void AddLogInfo(DateTime dtLogDateTime, String strServiceName, LOGGING_CLASS LoggingClass, String strLogMessage)
            => AddLogInfo(dtLogDateTime, strServiceName, "", LoggingClass, strLogMessage);
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログを追加する
        /// </summary>
        /// <param name="dtLogDateTime">ログ発生日時</param>
        /// <param name="strServiceName">サービス名</param>
        /// <param name="strGUICode">画面コード</param>
        /// <param name="LoggingClass">ログ種別</param>
        /// <param name="strLogMessage">ログ内容</param>
        //----------------------------------------------------------------------------------------------------
        public void AddLogInfo(DateTime dtLogDateTime, String strServiceName, String strGUICode, LOGGING_CLASS LoggingClass, String strLogMessage)
        {
            StringBuilder sb = new StringBuilder();

            // ログ作成
            //  施設コード
            sb.Append(this.FacilityCd);
            sb.Append(",");
            //  利用者ID
            sb.Append(this.AccountId);
            sb.Append(",");
            //  セッションID
            sb.Append(this.SessionId);
            sb.Append(",");
            //  デバイスエッジNO/体重計番号
            sb.Append(this.DeviceNo);
            sb.Append(",");
            //  デバイスエッジ製造番号
            sb.Append(this.DeviceSerialNo);
            sb.Append(",");
            //  型式
            sb.Append(this.MachineType);
            sb.Append(",");
            //  装置製造番号
            sb.Append(this.MachineSerialNo);
            sb.Append(",");
            //  EC2識別
            sb.Append(this.EC2ID);
            sb.Append(",");
            //  サービス名
            sb.Append(strServiceName);
            sb.Append(",");
            //  画面コード
            sb.Append(strGUICode);
            sb.Append(",");
            //  内部患者ID
            sb.Append(this.PatID);
            sb.Append(",");
            //  SQL名
            sb.Append(this.SQL);
            sb.Append(",");
            //  ログ種別
            sb.Append(LOGGING_CLASS_TEXT[(int)LoggingClass]);
            sb.Append(",");
            //  ログ内容
            sb.Append(strLogMessage);

            // ログ書き込み
            this.m_LoggingThread.AddLogInfo(this.LogExt, dtLogDateTime, sb.ToString());
        }

        public void AddErrorLogInfo(DateTime dtLogDateTime, String strServiceName, String strGUICode, LOGGING_CLASS LoggingClass, String strLogMessage)
        {
            StringBuilder sb = new StringBuilder();

            // ログ作成
            //  施設コード
            sb.Append(this.FacilityCd);
            sb.Append(",");
            //  利用者ID
            sb.Append(this.AccountId);
            sb.Append(",");
            //  セッションID
            sb.Append(this.SessionId);
            sb.Append(",");
            //  デバイスエッジNO/体重計番号
            sb.Append(this.DeviceNo);
            sb.Append(",");
            //  デバイスエッジ製造番号
            sb.Append(this.DeviceSerialNo);
            sb.Append(",");
            //  型式
            sb.Append(this.MachineType);
            sb.Append(",");
            //  装置製造番号
            sb.Append(this.MachineSerialNo);
            sb.Append(",");
            //  EC2識別
            sb.Append(this.EC2ID);
            sb.Append(",");
            //  サービス名
            sb.Append(strServiceName);
            sb.Append(",");
            //  画面コード
            sb.Append(strGUICode);
            sb.Append(",");
            //  内部患者ID
            sb.Append(this.PatID);
            sb.Append(",");
            //  SQL名
            sb.Append(this.SQL);
            sb.Append(",");
            //  ログ種別
            sb.Append(LOGGING_CLASS_TEXT[(int)LoggingClass]);
            sb.Append(",");
            //  ログ内容
            sb.Append(strLogMessage);

            // ログ書き込み
            this.m_LoggingThread.AddLogInfo(this.ErrorLogExt, dtLogDateTime, sb.ToString());
        }

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 指定日付以前のログファイルを削除する
        /// </summary>
        /// <param name="strServiceName">サービス名</param>
        /// <param name="nStorageDateCount">ログファイル保持日数[1～]</param>
        /// <param name="bLogging">ログ出力フラグ[true：ログ出力あり/false：ログ出力なし]</param>
        /// <returns>true：成功(対象がない場合含む)/false：失敗</returns>
        //----------------------------------------------------------------------------------------------------
        public bool DeleteLogFiles(String strServiceName, int nStorageDateCount, bool bLogging)
        {
            bool bret = true;
            const String strSearchPattern = "\\d{4}[0-1]\\d[0-3]\\d\\.(LOG|ZIP)";

            try
            {
                // 保持するログファイルの日数が1以上の場合
                if (0 < nStorageDateCount)
                {
                    int ndelcount = 0;
                    String strfilename;

                    // 削除対象基準日時を作成
                    DateTime dtdelbase = DateTime.Now.AddDays(-1 * nStorageDateCount);

                    // 正規表現によるファイル名マッチングパターン登録
                    Regex reg = new Regex(strSearchPattern, RegexOptions.IgnoreCase);

                    // ログファイル格納先に格納されているファイルを全て取得する
                    String[] logfiles = System.IO.Directory.GetFiles(this.m_LoggingThread.LogFolder, "*.*", System.IO.SearchOption.TopDirectoryOnly);
                    foreach (String strfile in logfiles)
                    {
                        try
                        {
                            // ファイル名(+拡張子)のみ取得
                            strfilename = System.IO.Path.GetFileName(strfile);

                            // ファイル名チェック
                            if (reg.Match(strfilename).Success == true)
                            {
                                // 有効なファイル名の場合

                                // 取得ファイルから更新日時を取得する
                                DateTime dtlastwrite = System.IO.File.GetLastWriteTime(strfile);

                                // 削除基準日時より古い場合
                                if (dtlastwrite < dtdelbase)
                                {
                                    // ファイル削除
                                    System.IO.File.Delete(strfile);

                                    ndelcount++;
                                }
                            }
                        }
                        catch (Exception ex)
                        {
#if DEBUG
                            Trace.WriteLine(String.Format("NKKLogging.DeleteLogFiles,File:{0},Error:{1}", strfile, ex.ToString()));
#endif
                            // 履歴記録
                            if (bLogging == true)
                            {
                                this.AddLogInfo(DateTime.Now, strServiceName, NKKLogging.LOGGING_CLASS.ERROR,
                                    String.Format("{0}.{1},file:{2},error:{3}", this.GetType().Name, MethodBase.GetCurrentMethod().Name, strfile, ex.ToString()));
                            }

                            bret = false;
                        }
                    }

                    // 履歴記録
                    if (bLogging == true)
                    {
                        this.AddLogInfo(DateTime.Now, strServiceName, LOGGING_CLASS.INFO, String.Format("ログ削除,{0:yyyy/MM/dd HH:mm:ss}以前,{1}件削除", dtdelbase, ndelcount));
                    }
                }
            }
            catch (Exception ex)
            {
#if DEBUG
                Trace.WriteLine(String.Format("NKKLogging.DeleteLogFiles,StrSearchPattern:{0},StorageData:{1},Error:{2}", strSearchPattern, nStorageDateCount, ex.ToString()));
#endif
                // 履歴記録
                if (bLogging == true)
                {
                    this.AddLogInfo(DateTime.Now, strServiceName, NKKLogging.LOGGING_CLASS.ERROR,
                        String.Format("{0}.{1},SearchPattern:{2},StorageData:{3},error:{4}", this.GetType().Name, MethodBase.GetCurrentMethod().Name, strSearchPattern, nStorageDateCount, ex.ToString()));
                }

                bret = false;
            }

            return (bret);
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// ログファイルを圧縮する
        /// ※当日以外のログファイルは圧縮後に削除する
        /// </summary>
        /// <param name="strServiceName">サービス名</param>
        /// <param name="bLogging">ログ出力フラグ[true：ログ出力あり/false：ログ出力なし]</param>
        /// <returns>true：成功(対象がない場合含む)/false：失敗</returns>
        //----------------------------------------------------------------------------------------------------
        public bool ZipLogFiles(String strServiceName, bool bLogging)
        {
            bool bret = true;
            const String strSearchPattern = "\\d{4}[0-1]\\d[0-3]\\d\\.LOG";

            try
            {
                String strfilename;

                // 正規表現によるファイル名マッチングパターン登録
                Regex reg = new Regex(strSearchPattern, RegexOptions.IgnoreCase);

                // ログファイル格納先に格納されているファイルを全て取得する
                String[] logfiles = System.IO.Directory.GetFiles(this.m_LoggingThread.LogFolder, "*.*", System.IO.SearchOption.TopDirectoryOnly);
                foreach (String strfile in logfiles)
                {
                    try
                    {
                        // ファイル名(+拡張子)のみ取得
                        strfilename = System.IO.Path.GetFileName(strfile);

                        // ファイル名チェック
                        if (reg.Match(strfilename).Success == true)
                        {
                            // 有効なファイル名の場合

                            // 圧縮ファイル名作成
                            String zipfilename = System.IO.Path.ChangeExtension(strfile, "ZIP");

                            // 圧縮済ファイル名チェック
                            if( System.IO.File.Exists( zipfilename ))
                            {
                                // 圧縮済ファイルを削除する
                                System.IO.File.Delete( zipfilename );
                            }

                            // 取得ファイルを圧縮する
                            bool res = TdcLib.TdcLib.CompressZipFile(this.Encoding, zipfilename, strfile, String.Empty, this.ZIP_PASSWORD);

                            // 履歴記録
                            if ( bLogging == true)
                            {
                                this.AddLogInfo(DateTime.Now, strServiceName, LOGGING_CLASS.INFO, String.Format("ログ圧縮{0},{1} → {2}", res ? "成功": "失敗", strfile, zipfilename ));
                            }

                            // 取得ファイルから更新日時を取得する
                            DateTime dtlastwrite = System.IO.File.GetLastWriteTime(strfile);

                            // 本日より前のファイルの場合は削除する
                            if(dtlastwrite < DateTime.Now.Date)
                            {
                                // ファイル削除
                                System.IO.File.Delete(strfile);

                                // 履歴記録
                                if (bLogging == true)
                                {
                                    this.AddLogInfo(DateTime.Now, strServiceName, LOGGING_CLASS.INFO, String.Format("ログ削除,{0}", strfile));
                                }
                            }
                        }
                    }
                    catch (Exception ex)
                    {
#if DEBUG
                        Trace.WriteLine(String.Format("{0}.ZipLogFiles,File:{0},Error:{1}", strfile, ex.ToString()));
#endif
                        // 履歴記録
                        if (bLogging == true)
                        {
                            this.AddLogInfo(DateTime.Now, strServiceName, NKKLogging.LOGGING_CLASS.ERROR,
                                String.Format("{0}.{1},file:{2},error:{3}", this.GetType().Name, MethodBase.GetCurrentMethod().Name, strfile, ex.ToString()));

                        }

                        bret = false;
                    }
                }

            }
            catch (Exception ex)
            {
#if DEBUG
                Trace.WriteLine(String.Format("NKKLogging.ZipLogFiles,StrSearchPattern:{0},Error:{1}", strSearchPattern, ex.ToString()));
#endif
                // 履歴記録
                if (bLogging == true)
                {
                    this.AddLogInfo(DateTime.Now, strServiceName, NKKLogging.LOGGING_CLASS.ERROR,
                        String.Format("{0}.{1},SearchPattern:{2},error:{3}", this.GetType().Name, MethodBase.GetCurrentMethod().Name, strSearchPattern, ex.ToString()));
                }

                bret = false;
            }

            return (bret);
        }
        //----------------------------------------------------------------------------------------------------

#endregion

    }
    //----------------------------------------------------------------------------------------------------
}
