//----------------------------------------------------------------------------------------------------
//  TDC製ベースソケットサーバー用クライアント処理クラス定義
//      継承元：TdcBaseSocket.cs
//----------------------------------------------------------------------------------------------------
using System;
using System.IO;
using System.Data;
using System.Net;
using System.Net.Sockets;
using System.Net.NetworkInformation;
//using System.Net.Security;
using System.Collections.Generic;
using System.Text;

#if DEBUG
using System.Diagnostics;
#endif


//----------------------------------------------------------------------------------------------------
//  TdcLib名前空間
//----------------------------------------------------------------------------------------------------
using TdcLib;

//----------------------------------------------------------------------------------------------------
//  TdcSocketLib名前空間
//----------------------------------------------------------------------------------------------------

namespace TdcSocketLib
{
    //----------------------------------------------------------------------------------------------------
    /// <summary>
    /// TDC製ベースソケットサーバー用クライアント処理クラス
    ///     継承元：TdcBaseSocket.cs
    /// </summary>
    //----------------------------------------------------------------------------------------------------
    public class TdcBaseSocketServerClient : TdcBaseSocket
    {

        #region パブリックプロパティ
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// サーバー内クライアントオブジェクト切断/切断通知用イベントハンドラー登録/参照用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public dgtTdcBaseSocketConnected ConnectedHandler
        {
            get { return (base.BaseConnectedHandler); }
            set { base.BaseConnectedHandler = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// サーバー内クライアントオブジェクト非同期送信完了通知用イベントハンドラー参照/設定用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public dgtTdcBaseSocketSendCompleted SendCompletedHandler
        {
            get { return (base.BaseSendCompletedHandler); }
            set { base.BaseSendCompletedHandler = value; }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// サーバー内クライアントオブジェクト受信時通知用イベントハンドラー登録/参照用プロパティ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public dgtTdcBaseSocketReceived ReceivedHandler
        {
            get { return (base.BaseReceivedHandler); }
            set { base.BaseReceivedHandler = value; }
        }
        //----------------------------------------------------------------------------------------------------
        #endregion


        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// コンストラクタ
        /// </summary>
        /// <param name="nRecvBufferSize">受信バッファーサイズ</param>
        //----------------------------------------------------------------------------------------------------
        public TdcBaseSocketServerClient(int nRecvBufferSize)
            : base(nRecvBufferSize)
        {
        }
        //----------------------------------------------------------------------------------------------------
    }
}
