truncate table mst_facility CASCADE;
truncate table mnt_motion_record;
truncate table mnt_gathering_manage;

DELETE FROM mst_user;

insert into mst_user
  (user_id, is_provisional)
values
  (1, 0),
  (2, 0),
  (3, 0),
  (4, 0),
  (5, 0)
;

insert into mst_facility
   (facility_cd, facility_name, facility_name_kana, department_cd, prefectures_cd)
values
   ('900001', 'テスト施設1', 'テストシセツ1', '9001', '01'),
   ('900002', 'テスト施設2', 'テストシセツ2', '9002', '02')
;

insert into mnt_motion_record
  (motion_record_no, facility_cd, machine_type_cd, machine_serial, event_reg_date, gathering_manage_no, data_type, machine_record_message, contents, user_id, machine_record_cd, machine_record_aux_data, email_name, email_text, is_correction,test_type)
values
  ( 1, '900001', '901', '90000001', '1980-01-01 23:59:59', 9, 1, 'message0000000001', '{"key":"value"}', 1, '0001', 'AUX0001', '9001', 'メール本文0001', 1, null),
  ( 2, '900001', '901', '90000001', '1980-01-01 00:00:00', 9, 1, 'message0000000002', '{"key":"value"}', 2, '0002', 'AUX0002', '9002', 'メール本文0002', 0, null),

  ( 3, '900001', '901', '90000001', '1980-11-09 00:00:00', 9, 1, 'message0000000003', '{"key":"value"}', 3, '0003', 'AUX0003', '9003', 'メール本文0003', 1, null),
  ( 4, '900001', '901', '90000001', '1980-11-09 00:00:01', 9, 1, 'message0000000004', '{"key":"value"}', 4, '0004', 'AUX0004', '9004', 'メール本文0004', 0, null),
  ( 5, '900001', '901', '90000001', '1980-11-09 00:00:02', 9, 1, 'message0000000005', '{"key":"value"}', 5, '0005', 'AUX0005', '9005', 'メール本文0005', 1, null),
  ( 6, '900001', '901', '90000001', '1980-11-08 23:59:59', 9, 1, 'message0000000006', '{"key":"value"}', 1, '0006', 'AUX0006', '9006', 'メール本文0006', 0, null),
  ( 7, '900001', '901', '90000001', '1980-11-07 00:00:00', 9, 1, 'message0000000007', '{"key":"value"}', 2, '0007', 'AUX0007', '9007', 'メール本文0007', 1, null),
  ( 8, '900001', '901', '90000001', '1980-11-06 00:00:00', 9, 1, 'message0000000008', '{"key":"value"}', 3, '0008', 'AUX0008', '9008', 'メール本文0008', 0, null),
  ( 9, '900001', '901', '90000001', '1980-11-05 00:00:00', 9, 1, 'message0000000009', '{"key":"value"}', 4, '0009', 'AUX0009', '9009', 'メール本文0009', 1, null),
  (10, '900001', '901', '90000001', '1980-11-04 00:00:00', 9, 1, 'message0000000010', '{"key":"value"}', 5, '0010', 'AUX0010', '9010', 'メール本文0010', 0, null),
  (11, '900001', '901', '90000001', '1980-11-03 00:00:00', 9, 1, 'message0000000011', '{"key":"value"}', 1, '0011', 'AUX0011', '9011', 'メール本文0011', 1, null),
  (12, '900001', '901', '90000001', '1980-11-02 00:00:00', 9, 1, 'message0000000012', '{"key":"value"}', 2, '0012', 'AUX0012', '9012', 'メール本文0012', 0, null),
  (13, '900001', '901', '90000001', '1980-11-01 00:00:00', 9, 1, 'message0000000013', '{"key":"value"}', 3, '0013', 'AUX0013', '9013', 'メール本文0013', 1, null),

  (14, '900001', '901', '90000001', '2009-09-09 19:09:09', 9, 9, 'message0000000014', '{"key":"value"}', 4, '0014', 'AUX0014', '9014', 'メール本文0014', 0, null),
  (15, '900002', '902', '90000002', '2010-01-01 00:00:01', 9, 1, 'message0000000015', '{"key1":"value1"}', 5, '0015', 'AUX0015', '9015', 'メール本文0015', 1, null),
  (16, '900002', '902', '90000002', '2010-01-02 00:00:02', 9, 2, 'message0000000016', '{"key2":"value2", "key3":"value3"}', 1, '0016', 'AUX0016', '9016', 'メール本文0016', 0, null),

  (91, '900002', '902', '90000002', '2014-12-30 14:44:43', 1, 3, 'message0000000091', '{"key1": "value1"}', 2, '0091', 'AUX0091', '9091', 'メール本文0091', 1, null),
  (92, '900002', '902', '90000002', '2014-12-31 23:59:59', 2, 5, 'message0000000092', '{"key2": "value2"}', 3, '0092', 'AUX0092', '9092', 'メール本文0092', 0, null),
  (93, '900002', '902', '90000002', '2015-01-01 00:00:00', 9, 6, 'message0000000093', '{"key3": "value3"}', 4, '0093', 'AUX0093', '9093', 'メール本文0093', 1, null),
  (94, '900002', '902', '90000002', '2015-01-01 00:00:01', 3, 4, 'message0000000094', '{"key4": "value4"}', 5, '0094', 'AUX0094', '9094', 'メール本文0094', 0, 1),
  (1234567890, '900001', '901', '90000001', '2001-01-01 00:00:01', 9, 1, 'message1234567890', '{"key": "value"}', 1, '9999', 'AUX9999', '9999', 'メール本文9999', 1, null)
;

INSERT INTO mnt_gathering_manage (gathering_manage_no, facility_cd, gathering_status, gathering_info, ope_info, parent_manage_no, user_id, reg_date, up_date) VALUES
  (1, '000001', 0, '[{"machine_info": [{"machine_no": "001M00000A3 ", "machine_err_cd": "00"}, {"machine_no": "999M1234567 ", "machine_err_cd": "00"}], "device_edge_no": 1, "device_edge_status": 1}]', 1, NULL, 1, '2017-12-05 16:33:48', '2017-12-06 11:44:18'),
  (2, '000001', 1, '[{"machine_info": [{"machine_no": "001M00000A3 ", "machine_err_cd": "00"}, {"machine_no": "999M1234567 ", "machine_err_cd": "00"}], "device_edge_no": 1, "device_edge_status": 0}]', 1, NULL, 1, '2017-12-01 16:35:02', '2017-12-06 18:35:02'),
  (3, '000001', 2, '[{"machine_info": [{"machine_no": "001M00000A3 ", "machine_err_cd": "00"}], "device_edge_no": 1, "device_edge_status": 1}]', 1, NULL, 1, '2017-12-05 16:38:52', '2017-12-06 17:12:40'),
  (4, '000001', 0, '[{"machine_info": [{"machine_no": "001M00000A3 ", "machine_err_cd": "00"}, {"machine_no": "999M1234567 ", "machine_err_cd": "00"}], "device_edge_no": 1, "device_edge_status": 0}]', 1, NULL, 1, '2017-12-01 16:35:02', '2017-12-07 18:35:02')
;

insert into mnt_motion_record
  (motion_record_no, facility_cd, machine_type_cd, machine_serial, event_reg_date, gathering_manage_no, data_type, machine_record_message, contents, user_id, machine_record_cd, machine_record_aux_data, email_name, email_text, is_correction, service_support_type, is_correction_up_date, service_support_user_id, service_support_up_date)
values
  ( 100, '900001', '903', '90000003', '2020-06-01 23:59:59', 9, 2, 'message0000000001', '{"key":"value"}', 1, '0001', 'AUX0001', '9001', 'メール本文0001', 1, 0, '2020-06-01 23:59:59', null, '2020-06-01 23:59:59'),
  ( 101, '900001', '904', '90000004', '2020-06-01 00:00:00', 9, 2, 'message0000000002', '{"key":"value"}', 2, '0002', 'AUX0002', '9002', 'メール本文0002', 0, 0, '2020-06-01 00:00:00', null, '2020-06-01 00:00:00'),
  ( 102, '900001', '904', '90000004', '2020-06-09 00:00:00', 9, 2, 'message0000000003', '{"key":"value"}', 3, '0003', 'AUX0003', '9003', 'メール本文0003', 1, 2, '2020-06-09 00:00:00', 1, '2020-06-09 00:00:00'),
  ( 103, '900001', '904', '90000004', '2020-06-09 00:00:01', 9, 2, 'message0000000004', '{"key":"value"}', 4, '0004', 'AUX0004', '9004', 'メール本文0004', 0, 0, '2020-06-09 00:00:01', null, '2020-06-09 00:00:01'),
  ( 104, '900001', '904', '90000004', '2020-06-09 00:00:02', 9, 2, 'message0000000005', '{"key":"value"}', 5, '0005', 'AUX0005', '9005', 'メール本文0005', 1, 3, '2020-06-09 00:00:02', 2, null),
  ( 105, '900001', '904', '90000004', '2020-06-08 23:59:59', 9, 3, 'message0000000006', '{"key":"value"}', 1, '0006', 'AUX0006', '9006', 'メール本文0006', 0, 0, '2020-06-08 23:59:59', null, '2020-06-08 23:59:59'),
  ( 106, '900001', '904', '90000004', '2020-06-07 00:00:00', 9, 3, 'message0000000007', '{"key":"value"}', 2, '0007', 'AUX0007', '9007', 'メール本文0007', 1, 0, '2020-06-07 00:00:00', null, '2020-06-07 00:00:00'),
  ( 107, '900001', '904', '90000004', '2020-06-06 00:00:00', 9, 4, 'message0000000008', '{"key":"value"}', 3, '0008', 'AUX0008', '9008', 'メール本文0008', 0, 0, '2020-06-06 00:00:00', null, null),
  ( 108, '900001', '904', '90000004', '2020-06-05 00:00:00', 9, 3, 'message0000000009', '{"key":"value"}', 4, '0009', 'AUX0009', '9009', 'メール本文0009', 1, 0, '2020-06-05 00:00:00', null, '2020-06-05 00:00:00'),
  ( 109, '900001', '904', '90000004', '2020-06-04 00:00:00', 9, 1, 'message0000000010', '{"key":"value"}', 5, '0010', 'AUX0010', '9010', 'メール本文0010', 0, 0, '2020-06-04 00:00:00', null, null)
;

-- 最大イベント発生日時（装置）のテスト用データ
insert into mst_facility
   (facility_cd, facility_name, facility_name_kana, department_cd, prefectures_cd)
values
   ('900005', 'テスト施設5', 'テストシセツ5', '9005', '18')
;
insert into mnt_motion_record
  (
    motion_record_no,
    facility_cd,
    machine_type_cd,
    machine_serial,
    event_reg_date,
    gathering_manage_no,
    data_type,
    machine_record_message,
    contents,
    user_id,
    machine_record_cd,
    machine_record_aux_data,
    email_name,
    email_text,
    is_correction,
    service_support_type,
    is_correction_up_date,
    service_support_user_id,
    service_support_up_date)
values
  ( 110, '900005', '905', '90000005', '2020-06-11 23:59:59', 9, 2, 'message0000000001', '{"key":"value"}', 1, '0001', 'AUX0001', '9001', 'メール本文0001', 1, 0, '2020-06-01 23:59:59', null, '2020-06-01 23:59:59'),
  ( 111, '900005', '905', '90000005', '2020-06-11 00:00:00', 9, 2, 'message0000000002', '{"key":"value"}', 2, '0002', 'AUX0002', '9002', 'メール本文0002', 0, 0, '2020-06-01 00:00:00', null, '2020-06-01 00:00:00'),
  ( 112, '900005', '905', '90000005', '2020-06-19 00:00:00', 9, 2, 'message0000000003', '{"key":"value"}', 3, '0003', 'AUX0003', '9003', 'メール本文0003', 1, 2, '2020-06-09 00:00:00', 1, '2020-06-09 00:00:00'),
  ( 113, '900005', '905', '90000005', '2020-06-19 00:00:01', 9, 2, 'message0000000004', '{"key":"value"}', 4, '0004', 'AUX0004', '9004', 'メール本文0004', 0, 0, '2020-06-09 00:00:01', null, '2020-06-09 00:00:01'),
  ( 114, '900005', '905', '90000005', '2020-06-19 00:00:02', 9, 2, 'message0000000005', '{"key":"value"}', 5, '0005', 'AUX0005', '9005', 'メール本文0005', 1, 3, '2020-06-09 00:00:02', 2, null),
  ( 115, '900005', '905', '90000005', '2020-06-18 23:59:59', 9, 3, 'message0000000006', '{"key":"value"}', 1, '0006', 'AUX0006', '9006', 'メール本文0006', 0, 0, '2020-06-08 23:59:59', null, '2020-06-08 23:59:59'),
  ( 116, '900005', '905', '90000005', '2020-06-17 00:00:00', 9, 3, 'message0000000007', '{"key":"value"}', 2, '0007', 'AUX0007', '9007', 'メール本文0007', 1, 0, '2020-06-07 00:00:00', null, '2020-06-07 00:00:00'),
  ( 117, '900005', '905', '90000005', '2020-06-16 00:00:00', 9, 4, 'message0000000008', '{"key":"value"}', 3, '0008', 'AUX0008', '9008', 'メール本文0008', 0, 0, '2020-06-06 00:00:00', null, null),
  ( 118, '900005', '905', '90000005', '2020-06-15 00:00:00', 9, 3, 'message0000000009', '{"key":"value"}', 4, '0009', 'AUX0009', '9009', 'メール本文0009', 1, 0, '2020-06-05 00:00:00', null, '2020-06-05 00:00:00'),
  ( 119, '900005', '905', '90000005', '2020-06-14 00:00:00', 9, 1, 'message0000000010', '{"key":"value"}', 5, '0010', 'AUX0010', '9010', 'メール本文0010', 0, 0, '2020-06-04 00:00:00', null, null)
;
