insert into mnt_machine_state
  (facility_cd, machine_type_cd, machine_serial, model, machine_name, bed_name, process_state, m_notice_cnt, preventive_mainte_cnt, is_preventive_mainte, service_support_cnt)
values
  ('900001', '901', '90000001', '001', 'テスト装置1', 'テストベッド1', '01', '0', '0', '0', 0),
  ('900001', '901', '90000002', '001', 'テスト装置2', 'テストベッド2', '02', '0', '0', '0', 0),
  ('900001', '901', '90000003', '001', 'テスト装置3', 'テストベッド3', '03', '0', '0', '0', 1),
  ('900001', '901', '90000004', '002', 'テスト装置4', 'テストベッド4', '04', '0', '0', '0', 0),
  ('900001', '901', '90000005', '002', 'テスト装置5', 'テストベッド5', '05', '0', '0', '0', 0),
  ('900001', '901', '90000006', '003', 'テスト装置6', 'テストベッド6', '06', '0', '0', '0', 3),
  ('900001', '901', '90000007', '004', 'テスト装置7', 'テストベッド7', '07', '0', '0', '0', 0),
  ('900001', '901', '90000008', '005', 'テスト装置8', 'テストベッド8', '08', '0', '0', '0', 0),
  ('900001', '901', '90000009', '006', 'テスト装置9', 'テストベッド9', '09', '0', '0', '0', 0),
  ('900001', '901', '90000010', '007', 'テスト装置10', 'テストベッド10', '10', '0', '0', '0', 0),
  ('900002', '901', '90000001', '008', 'テスト装置1', 'テストベッド1', '01', '0', '0', '0', 2),
  ('900003', '903', '90000013', '001', 'ESMマシン1', 'ESMベッド1', '01', '3', '2', '1', 3),
  ('900004', '904', '90000041', '001', 'ESMマシン41', 'ESMベッド41', '00', '1', '2', '0', 4),
  ('900004', '904', '90000042', '001', 'ESMマシン42', 'ESMベッド42', '01', '0', '5', '1', 5),
  ('900005', '905', '90000045', '001', 'ESMマシン45', 'ESMベッド45', '01', null, null, '1', 0),
  ('900005', '905', '90000046', '001', 'ESMマシン46', 'ESMベッド46', '01', null, 1, '1', 1),
  ('900005', '905', '90000047', '001', 'ESMマシン47', 'ESMベッド47', '01', 2, null, '1', null)
  ;

insert into mst_facility
  (facility_cd, facility_name, prefectures_cd, department_cd)
values
  ('900001', 'テスト施設名', '01', '9001'),
  ('900002', 'テスト病院', '01', '9002'),
  ('900003', 'ESMクリニック', '02', '9003'),
  ('900004', 'ESM病院', '03', '9004')
;

insert into mst_machine_type
  (machine_type_cd, machine_type)
values
  ('901', 'ABCD001')
;

insert into mst_machine
  (facility_cd, machine_type_cd, machine_serial, com_format_cd, com_type, device_edge_no, is_ftp, is_va, version)
values
  ('900002', '901', '90000001', 'A', 1, 10, '0', '0', '1'),
  ('900004', '904', '90000041', 'A', 1, 11, '0', '0', '1'),
  ('900004', '904', '90000042', 'R', 1, 11, '1', '0', '1')
