//----------------------------------------------------------------------------------------------------
//  汎用XML
//----------------------------------------------------------------------------------------------------
using System;
using System.Collections.Generic;
using System.Text;
using System.Data;
using System.Xml;

#if DEBUG
    using System.Diagnostics;
#endif

//----------------------------------------------------------------------------------------------------
//  TdcLib名前空間
//----------------------------------------------------------------------------------------------------
namespace TdcLib
{
    //----------------------------------------------------------------------------------------------------
    /// <summary>
    /// 汎用XMLクラス
    /// </summary>
    //----------------------------------------------------------------------------------------------------
    public class TdcXml
    {

#region プライベート定義

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// XMLドキュメントファイル名
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private String m_strXmlFileName = String.Empty;
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// XMLドキュメントオブジェクト
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private XmlDocument m_XmlData = new XmlDocument();
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 直前で発生したエラーオブジェクト
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        private Exception m_Exception = null;
        //----------------------------------------------------------------------------------------------------

#endregion

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// コンストラクタ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public TdcXml()
        {
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// デストラクタ
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public void Dispose()
        {
        }
        //----------------------------------------------------------------------------------------------------


#region パブリックプロパティ

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 直前に発生したエラーオブジェクト取得/設定
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public Exception Error
        {
            get
            {
                return (this.m_Exception);
            }

            set
            {
                this.m_Exception = value;

#if DEBUG
                Trace.WriteLine( String.Format( "TdcXml Error:{0}", value.ToString()));
#endif
            }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// XMLドキュメントオブジェクト
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public XmlDocument Document
        {
            get
            {
                return (this.m_XmlData);
            }

            set
            {
                this.m_XmlData = value;
            }
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// XMLドキュメントファイル名
        /// </summary>
        //----------------------------------------------------------------------------------------------------
        public String FileName
        {
            get
            {
                return (this.m_strXmlFileName);
            }
            set 
            {
                this.m_strXmlFileName = value;
            }
        }
        //----------------------------------------------------------------------------------------------------

#endregion


#region パブリックメソッド

        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// XMLファイルを読み込む
        /// </summary>
        /// <param name="strFileName">XMLファイル名</param>
        /// <returns></returns>
        //----------------------------------------------------------------------------------------------------
        public bool Load(String strFileName)
        {
            bool bret = false;

            try
            {
                // XMLファイル名をクリア
                this.FileName = String.Empty;

                // XMLドキュメント読み込み
                this.m_XmlData.Load(strFileName);

                // XMLファイル名を記憶
                this.FileName = strFileName;

                bret = true;
            }
            catch (Exception ex)
            {
                this.Error = ex;
            }

            return (bret);
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// XMLファイルを書き込む
        /// </summary>
        /// <returns>true：成功/false：失敗</returns>
        /// <remarks>Loadメソッドで指定されたファイルに書き込みを行う</remarks>
        //----------------------------------------------------------------------------------------------------
        public bool Save()
        {
            return( this.Save( this.FileName ));
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// XMLファイルを書き込む
        /// </summary>
        /// <param name="strFileName">XMLファイル名</param>
        /// <returns>true：成功/false：失敗</returns>
        //----------------------------------------------------------------------------------------------------
        public bool Save(String strFileName)
        {
            bool bret = false;

            try
            {
                // XMLドキュメントを指定ファイル名で記録
                this.m_XmlData.Save(strFileName);

                bret = true;
            }
            catch (Exception ex)
            {
                this.Error = ex;
            }

            return (bret);
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 指定ノードの設定値読込
        /// </summary>
        /// <param name="strNodeName">XMLノード名称(ネストしているノードを指定する場合は'\\'で区切る)</param>
        /// <param name="strTagName">XMLタグ名称</param>
        /// <param name="strDefaultValue">既定値</param>
        /// <returns>設定値</returns>
        //----------------------------------------------------------------------------------------------------
        public String GetValue(String strNodeName, String strTagName, String strDefaultValue)
        {
            return (TdcLib.GetXmlTagData(TdcLib.GetXmlNode( this.m_XmlData, strNodeName), strTagName, strDefaultValue));
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 指定ノードの設定値読込(CRLF除去)
        /// </summary>
        /// <param name="strNodeName">XMLノード名称</param>
        /// <param name="strTagName">XMLタグ名称</param>
        /// <param name="strDefaultValue">既定値</param>
        /// <returns>設定値</returns>
        //----------------------------------------------------------------------------------------------------
        public String GetSingleLineValue( String strNodeName, String strTagName, String strDefaultValue )
        {
            return (this.GetValue(strNodeName, strTagName, strDefaultValue).Replace( System.Environment.NewLine, String.Empty));
        }
        //----------------------------------------------------------------------------------------------------
        /// <summary>
        /// 指定ノードの設定値書込
        /// </summary>
        /// <param name="strNodeName">XMLノード名称</param>
        /// <param name="strTagName">XMLタグ名称</param>
        /// <param name="strValue">設定値</param>
        /// <returns>true：成功/false：失敗</returns>
        //----------------------------------------------------------------------------------------------------
        public bool SetValue(String strNodeName, String strTagName, String strValue)
        {
            return (TdcLib.SetXmlTagData(TdcLib.SetXmlNode(this.m_XmlData, strNodeName), strTagName, strValue));
        }
        //----------------------------------------------------------------------------------------------------

#endregion

    }
    //----------------------------------------------------------------------------------------------------
}
